[{"title":"WOOT! FIRST POST!","description":"This is my first post on the blog...I hope that  I'll have something interesting to say. Well, I guess the first post should have a little to do with ","slug":"2003-02-07-WOOT-FIRST-POST"},{"title":"HELPING C VETERANS WITH .NET","description":"My boss asked me to come into work today to explain accessing a database in .NET to one of our developers who mainly codes in C. It was pretty interes","slug":"2003-02-08-HELPING-C-VETERANS-WITH-NET"},{"title":"Monday morning...","description":"What better to do on a Monday morning than find out which type of OS your personality is matched with? Makes you look nice and busy, and from the othe","slug":"2003-02-10-Monday-morning"},{"title":"Generating Ideas...","description":"\nI've decided to try and make my life a little easier. Controls. I've jumped into them a little in the past, but now I may have a little more time to ","slug":"2003-02-11-Generating-Ideas"},{"title":"Nearing completion...","description":"I'm getting to the clean-up phase of porting an asp.old project to .NET. It's about time! I finally tackled a problem I ran into with a vb6 component ","slug":"2003-02-11-Nearing-completion"},{"title":"ReporT!!","description":"Okay, it's not as if anyone is reading this - but for those of you who are (hey, Chris!) - here is why I didn't post yesterday.\n\nI've been working wit","slug":"2003-02-13-ReporT"},{"title":".NET Brain Farts","description":"Today Seems like an extended Moday as far as my development goes. I've tried about 3 or 4 different tings on my current project that just don't seem t","slug":"2003-02-18-NET-Brain-Farts"},{"title":"Jump into VB.NET - feet furst","description":"Today I'm applying OOP changes to a VB.NET dll that was upgraded from VB6 - so that means I'm taking out all of the On Error GoTo fnName_Error and Rep","slug":"2003-02-21-Jump-into-VBNET-feet-furst"},{"title":"Getting Started on some Controls Issues","description":"I decided to go ahead and try to start building something in the control arena - something I haven't visited for some months now.\n\nI figured it would ","slug":"2003-02-22-Getting-Started-on-some-Controls-Issues"},{"title":"Cool uses for DHTML","description":"Mark forwarded me a link today of a site that pushes DHMTL to the max. I've gone on record before about my loathing for web development, but I know a ","slug":"2003-02-26-Cool-uses-for-DHTML"},{"title":"I am the Framework.  I run managed code.  I am without flaw.","description":"Get a heads up on running multiple versions of the Framework. ShowUsYour-Blog!\n\nI read Darren's post, and subsequently the referenced article by Early","slug":"2003-02-28-I-am-the-Framework-I-run-managed-code-I-am-without-flaw"},{"title":"Stupid Cookie.Domain","description":"I've spent about 1 1/2 hours trying to figure out why I couldn't get a persistent cookie set from codebehind in ASP.NET...I tried a lot of different t","slug":"2003-03-05-Stupid-Cookie-Domain"},{"title":"Added HTTP Request code snippit","description":"I'm adding a new category of posts to my blog; code snippits.  I was looking for a tool to manage code snippits when it hit me, why not post them to m","slug":"2003-03-10-Added-HTTP-Request-code-snippit"},{"title":"Added Editing a custom icon to a web server control story","description":"Man, Don, you've got me going nutz\nwith your code-postin\nshennanigans. I've just added a new story, explaining\nhow I used Photoshop 7 and Imageready 7","slug":"2003-03-11-Added-Editing-a-custom-icon-to-a-web-server-control-story"},{"title":"Added 'Extending the MetaBuilder's RollOverLink' Story","description":"I just added a little explanation of how I extended the RollOverLink&nbsp;found on MetaBuilders.com. All I did really was add a statusbar message and ","slug":"2003-03-11-Added-Extending-the-MetaBuilders-RollOverLink-Story"},{"title":"Custom configuration sections","description":"Something I've found infinitely useful is custom configuration sections.  By using custom configuration sections, you are allowed to store a richer am","slug":"2003-03-11-Custom-configuration-sections"},{"title":"Taking Custom Configuration Sections A Step Further","description":"Yup, it's cool, but it gets even cooler when you start writing your own configuration section handler implementations. The beauty of the configuration","slug":"2003-03-12-Taking-Custom-Configuration-Sections-A-Step-Further"},{"title":"Stupid [fill in the blank]","description":"I've been working today with farpoint's spread for webforms control, trying\nto make it act like you would want a spreadsheet to work. I've been focusi","slug":"2003-03-14-Stupid-fill-in-the-blank"},{"title":"I've taken the plunge...","description":"I finally did it. I 'upgraded' my home pc to XP. It took forever, probably b/c I have a pretty slow processor - 400mhz, but it's up, it's running, and","slug":"2003-03-16-Ive-taken-the-plunge"},{"title":"Remote Desktop","description":"Just a quick post - I've been toying w/ the idea of a software KVM - using terminal services. Keith gave me a link for the client which he says works ","slug":"2003-03-16-Remote-Desktop"},{"title":"added custom config section handler story.","description":"\nI just added a story describing how I've made my ImageLink control jump thru some more hoops for an application-specific purpose. If anyone is intere","slug":"2003-03-17-added-custom-config-section-handler-story"},{"title":"Happiness is getting...","description":"...the first issue of Ingo's Distributed .NET Newsletter. If you are doing anything distributed in\n.NET, you need to be subscribed. Heck, you need to ","slug":"2003-03-18-Happiness-is-getting"},{"title":"Boo! on ASP.NET Validators!","description":"So I'm trying to get a regular expression validator to\nwork - ya know, validate my data. I'm a reeeeal novice when it comes to regex,\nso with a little","slug":"2003-03-27-Boo-on-ASP-NET-Validators"},{"title":"A Blessing in disguise? (follow-up to 'Boo! on Validators')","description":"This is what I love about blogging here. I not only got to work out the problem in a different way than I would have alone, but I also got some great ","slug":"2003-03-28-A-Blessing-in-disguise-follow-up-to-Boo-on-Validators"},{"title":"Have YOU ever heard of Detroit....TX? No one else has, either","description":"but, that's where I'm going tomorrow. My son lives there with his brother, their mom (baby's momma:), and Nana and Papa (the Grandparents). It's going","slug":"2003-03-28-Have-YOU-ever-heard-of-Detroit-TX-No-one-else-has-either"},{"title":"10 hrs on the road and over 600 miles covered...and worth every second.","description":"I got back from seeing Ethan monster late Sunday afternoon...I'm just too proud. My boy is walking like a champ! Talking, too. I was holding him, and ","slug":"2003-03-31-10-hrs-on-the-road-and-over-600-miles-covered-and-worth-every-second"},{"title":"Boy, am I glad to see you!","description":"Make that, girl am I glad to see you. ...\nWhich brings me to my next question, why aren't there more female Bloggers here?  If there are of you out th","slug":"2003-03-31-Boy-am-I-glad-to-see-you"},{"title":"More! More! More!!","description":"\nYa know, the site that's set up for us dotnetwebloggers is real cool. You can do everything there.\n\nI'd like to see similar functionality added to my","slug":"2003-03-31-More-More-More"},{"title":"More! More! More! - It's Coming - Woohoo!","description":"In the coming week(s) the webservice(s) will be much improved. The current webservice is just a quick wrapper around my display objects (hence there i","slug":"2003-04-01-More-More-More-It's-Coming-Woohoo"},{"title":"Starter Kits Rule!","description":"If you're looking to get a site up in a hurry, with a minimum of fuss, then you owe it to yourself to check out the ASP.NET Starter Kits, downloadable","slug":"2003-04-03-Starter-Kits-Rule"},{"title":"In need of direction...(was:Don...you're doing it again :|)","description":"&lt;snip/&gt;\nP.S. - Chris, if you're reading this...I sent you an e-mail. :)\n\\[David Stone's Blog\\]\n\nI sent over a similar email...I guess I should h","slug":"2003-04-06-In-need-of-direction-was-Don-youre-doing-it-again"},{"title":"Aggregator integration","description":"&lt;snip/&gt;\nWhat do you all think? Is aggregator integration into Outlook a good thing? Is it a \"must have\" feature for you? Comment or blog and let","slug":"2003-04-07-Aggregator-integration"},{"title":"Aggrrregator Overload! ---- SharpReader.","description":"ok.  Harvester is fun.  RssBandit is better.  SharpReader Owns.  Its just really, really slick;  the threaded posts functionality is killer;  the abil","slug":"2003-04-07-Aggrrregator-Overload-SharpReader"},{"title":"SharpReader","description":"&lt;snip/&gt;\nUPDATE: I am having problems add more than one feed to a category (which kind of defeats the purpose). Anyone else notice this behavior?","slug":"2003-04-07-SharpReader"},{"title":"I love this stuff.","description":"As a developer, I consider myself more of a problem solver. One of my least favorite problems: Com Interop. I can't shake it. It seems that no matter ","slug":"2003-04-08-I-love-this-stuff"},{"title":"Ok, I'll try one more time...","description":"Chris wrote a while back about the source/binaries for his blog engine that his site uses. Count me way in! I'm looking to do something similar to use","slug":"2003-04-08-Ok-Ill-try-one-more-time"},{"title":"devenv.exe /setup","description":"This was a switch I didn't even know existed from the command line. I was having some issues with VS.NET 2002 and custom Add in tools. I couldn't figu","slug":"2003-04-08-devenv-exe-setup"},{"title":"MBSA","description":"Yes I have heard of it, and yes I do use it - although probably not as often as I should :S. I personally prefer the GUI, but that's just me. I like t","slug":"2003-04-09-MBSA"},{"title":"the Scoble says...","description":"If the FrontPage team wants some consulting, you know where to find me.\n\nWill you be charging your normal dollar rate?:)","slug":"2003-04-09-the-Scoble-says"},{"title":"Clippy","description":"By the way, I know some of you folks played around with this a little... any stories?\n\\[Rachel Reese's Blog\\]\n\nI showed it to the bossman...he loved i","slug":"2003-04-11-Clippy"},{"title":"More on aggregators...","description":"Added Dare's RssBandit 1.0d, 1.1beta to the home machine...couldn't get it to work right away :(\n\nAdded Chris's Harvester to the home machine...couldn","slug":"2003-04-12-More-on-aggregators"},{"title":"Scobleizer vs Dvorak","description":"Who are most people in the industry going to believe? Dvorak or Scoble?\n\\[The Scobleizer Weblog\n\nOne hardcore .net developer for Scoble, right here!","slug":"2003-04-12-Scobleizer-vs-Dvorak"},{"title":"Where is everybody?","date":"2003-04-12T02:30:00.000Z","description":"&lt;snip/&gt;\nWhere is everybody? You can't all leave me here alone...it's not fair! So if you are actually sharing my boredom here, tell me what you'","slug":"2003-04-12-Where-is-everybody"},{"title":"asp.net user control to display scrollable rss2.0 feeds","description":"&lt;snip/&gt;\nWhad'ya all think?\n&lt;/snip&gt;\n\\[Julia Lerman Blog\n\nSweet! I like the inter face, looks very similar to something I have in mind. I'm ","slug":"2003-04-12-aspnet-user-control-to-display-scrollable-rss20-feeds"},{"title":"dotnetweblogs integration.","description":"I already have this blog on dotnetweblogs.com, but I feel kind of bad using someone else's server to post random crap on the web. Therefore, I was goi","slug":"2003-04-14-dotnetweblogs-integration"},{"title":"xhtml.xsd?","description":"Where the heck do I get my grubby developer hands on\nthis little beast if I can't browse, save in IE? My other browsers (Opera\n6.04/Mozilla 1.0) can't","slug":"2003-04-15-xhtml-xsd"},{"title":"Added new Story on using Reflection to make dynamic about pages.","description":"Check it out here.","slug":"2003-04-17-Added-new-Story-on-using-Reflection-to-make-dynamic-about-pages"},{"title":"BlogThis - Thanks Simon","description":"\nI forgot to mention that while many people posted their thoughts about BlogThis (XML, Interface, etc), it was Simon Fell who brought it too life. Tha","slug":"2003-04-17-BlogThis-Thanks-Simon"},{"title":"Need Logo","description":"I am getting pretty close to having a downloadable version ready for public consumption.\nOne thing I am still lacking is a nice \"powered by ASPNetWebL","slug":"2003-04-18-Need-Logo"},{"title":"Pingbacks/trackbacks","description":"Just 'fixed' the incoming links control over to your right there--&gt;\nThis is great stuff - I was going to roll my own type of deal here, but decided","slug":"2003-04-23-Pingbacks-trackbacks"},{"title":"A sexy UI","description":"The world must be about to end. Jeffrey Zeldman has an RSS feed and Chris Pirillo has a weblog format without a stupid font. Now if we could only get ","slug":"2003-04-25-A-sexy-UI"},{"title":"GeoBlog.","description":"I really, really like various tools that mix blogspace with meatspace.  GeoBlog is frickin cool. real time map of blog postings, as they happen. In th","slug":"2003-04-25-GeoBlog"},{"title":"The logic (or lack thereof) behind xhtml:body","description":"When Sam started a small revolution last month by using &lt;xhtml:body&gt;  in his rss-feed, &lt;snip/&gt;\nOn top of that, it seems like every rss fee","slug":"2003-04-25-The-logic-or-lack-thereof-behind-xhtml-body"},{"title":"More Integration.","description":"Also, thanks Scott for the simpleblogservice...I think this will be the way to go, of course using post to put new entries in based on an infiniblog b","slug":"2003-04-28-More-Integration"},{"title":"The new Look, feel, and function of dotnetweblogs.com","description":"\nGreat job, Scott. I've decided to clean up my dotnetblogspace a little bit, so I've moved my story links here. Mucho cleaner, IMHO.","slug":"2003-04-28-The-new-Look-feel-and-function-of-dotnetweblogs-com"},{"title":"Almost.","description":"\nI'm getting close...Trying to figure out what's going wrong here....must ping more.","slug":"2003-04-30-Almost"},{"title":"Success.","description":"Why didn't I see these 'ping' posts earlier? Looks to me like I've got some integration to clean up! HA!\n\nSo the posts below that say something like '","slug":"2003-04-30-Success"},{"title":"Last ping w/o post...","description":"Okay, the last one didn't go thru - still trying to sort the logic. sorry again, Scott.\n\nThis is great stuff, tho. I've learned more about xml-rpc/web","slug":"2003-05-01-Last-ping-w-o-post"},{"title":"Win2k Terminal Services.","description":"I'm pretty sure no one was paying attention  (even me:), but I made a post a while back about using Terminal Services as a sort of Software KVM.\n\nWell","slug":"2003-05-01-Win2k-Terminal-Services"},{"title":"Comment Storage","date":"2003-05-02T16:20:00.000Z","description":"This comment stuff is proving to be harder than I thought.\n\nThe problem is not the API, which seems pretty straightforward. It's in the way that I wil","slug":"2003-05-02-Comment-Storage"},{"title":"Comments...help?","description":"Does anyone have any pointers / links / resources I could look at for supporting comments in a blog system? I think I'm ready to implement this over @","slug":"2003-05-02-Comments-help"},{"title":"Hyperlink This!","description":"&lt;snip/&gt;\nMost developers do not put much thought into hyperlinks.  Most of what I've covered today is common sense, but it does pay to look back ","slug":"2003-05-02-Hyperlink-This"},{"title":"To CommentAPI, or not to CommentAPI?","description":"I've decided to take an approach based very loosely on the CommentAPI. I'm not adding the ability to post from outside of the base site yet, but I'm t","slug":"2003-05-02-To-CommentAPI-or-not-to-CommentAPI"},{"title":"My favorite Exception.","description":"\"Object reference not set to an instance of an object\"\n\nI'm not usually one to make my ignorance publicly known.\n\nOkay, if you've seen any amount of m","slug":"2003-05-04-My-favorite-Exception"},{"title":"Effective Linking","description":"&lt;snip&gt;\nIf I'm referring to a person, I'll link directly to the home page of that persons blog, preferably identifying them however they choose t","slug":"2003-05-05-Effective-Linking"},{"title":"From one of the funniest blog titles department...","description":"How ubiquitous...:P","slug":"2003-05-06-From-one-of-the-funniest-blog-titles-department"},{"title":"Functional Decomposition","description":"Functional Decomposition: A method of breaking down a problem into smaller and smaller functions. Each function is subdivided until it is manageable.\n","slug":"2003-05-12-Functional-Decomposition"},{"title":"Delimma","description":"\nDelimma: What the heck am I? I get to the launch event and there are three 'tracks' you can take:\n\nDeveloper\nArchitect\nIT Pro.\n\nObviously, IT Pro is ","slug":"2003-05-13-"},{"title":"Lessons learned.","description":"Just got back from the windows server 2003 launch event. Got some cool toys to play with, but I learned some interesting things...here's the gist.\n\nFi","slug":"2003-05-13-Lessons-learned"},{"title":"developerLabs","description":"By far, the most interesting aspect of the windows 2003 launch event came from someone who is NOT employed by m$...Stephen \"7 of 9\" Fulcher.\n\nWhy \"7 o","slug":"2003-05-13-developerLabs"},{"title":"WYSIWYG 4 Opera","description":"Just wondering;  has anyone figured out how to do rich text editing in other browsers, i.e. Opera?\\[Objective\\]\n\n[http://www.google.com/search?hl=en&l","slug":"2003-05-15-WYSIWYG-4-Opera"},{"title":"The Bridge Whatsis?","description":"The Bridge pattern. All I have to say is...\"huh?\". Is it me or does this pattern seem like more of an abstract idea than the others I've seen so far? ","slug":"2003-05-20-The-Bridge-Whatsis"},{"title":"dmrader","description":"Welcome to my pal Devin Rader who has just started a blog on dotnetweblogs.\n\n&lt;snip/&gt;\n\n\\[Julia Lerman Blog\\]\n\nSubscribed.\n\n\\[Listening to: Two Ta","slug":"2003-05-20-dmrader"},{"title":"RegExValidator Tester","description":"I just had to do a test for a RegExValidator.\n\nWow! Interesting, no? Keep reading.\n\nA while back, I had to do a few tests to check if certain regEx's ","slug":"2003-05-21-RegExValidator-Tester"},{"title":"HashConfigCs","description":"I just made a change to some code I wrote a while back that generates a text file with strong encryption/decryption keys for use in a machine.config o","slug":"2003-05-23-HashConfigCs"},{"title":"Unwittingly giving Google Juice...","description":"&lt;snip&gt;\nWell, I'm sure that lots of webloggers will fall into that trap.\nNot me.\n&lt;/snip&gt;\n\\[The Scobleizer Weblog\\]\n\nD'oh!","slug":"2003-05-28-Unwittingly-giving-Google-Juice"},{"title":"Cross-posting revisited","description":"One more thing - ScottW, you're the dude. man. whateva.\n\nAll I had to do this morning to enable cross-posting from my non-read space was change the ur","slug":"2003-05-30-Cross-posting-revisited"},{"title":"Pattern Primate...","description":"...from code monkey:P. Rollin right along, I'm getting more used to using patterns in my regular speech (as a developer, anyway:)\n\nTrouble is, as I've","slug":"2003-05-30-Pattern-Primate"},{"title":"You're a nerd.","description":"Last night I couldn't go to sleep, so I hopped on my laptop @ 1:00am.\n\nThe funny part is,  when my modem stopped hand-shaking, one of my favorite 'sof","slug":"2003-05-30-Youre-a-nerd"},{"title":"VS.NET being difficult...","description":"Uh-oh. I did a little finishing touches to my latest application, Risk Analysis  and it looks like Visual Studio doesn't like something I've done late","slug":"2003-05-31-VS.NET-being-difficult"},{"title":"+1 reader","description":"Heh, I've got 3 readers now.\n\nSomeone pinged me and said the link in my previous post doesn't work. Sorry bout that, it won't be \"live\" until Monday a","slug":"2003-06-01-1-reader"},{"title":"Exception Management Block","description":"Okay, so I dove into the Exception Management Application Block today.\n\nI've been using it on a current application, but I wanted an email to be sent ","slug":"2003-06-03-Exception-Management-Block"},{"title":"Srinath says","description":"Srinath says regarding my previous post:\n\nPlease check our secure guide, section \"Accessing System Resources &gt; Accessing Event Log\" at http://msdn.","slug":"2003-06-03-Srinath-says"},{"title":"Log this!","description":"What's your poison? Exception Management Application Block or log4net ?\n\nWhy?","slug":"2003-06-04-Log-this"},{"title":"Must...resist...","description":"Must...resist...giving...Dvorak google juuce!","slug":"2003-06-04-must-resist"},{"title":"xsd2db and Me","description":"I have been looking for xsd2db, a tool for generating a database schema from an XML schema, ever since I read this article.  Unfortunately, when it ca","slug":"2003-06-06-xsd2db-and-Me"},{"title":"The .NET pledge","description":"I took the pledge. You should, too.\n\nGood stuff, Sam.","slug":"2003-06-07-The-NET-pledge"},{"title":"That's great. It's a website.","description":"Earlier tonight, I showed my girlfriend Tina some of the work I've done, namely www.velocitydatabank.com and my most recent endeavor, Risk Analysis. L","slug":"2003-06-08-Thats-great-Its-a-website"},{"title":"ypXmlTree","description":"I'm still kicking around some ideas for an online aggregator, so I can maybe look over some of the blogs I frequent over my loverly dial-up connextion","slug":"2003-06-08-ypXmlTree"},{"title":"Member cap","description":"Each Workspace has a maximum limit of 500 members.\n\\[gotdotnet workspaces\\]\n\nWha? I thought it was only 20. Very interesting....","slug":"2003-06-14-Member-cap"},{"title":"Added a snippet  DHTML ImageButton server control","description":"Thanks to a recent upgrade(?) to this here blog engine, I was able to recover a story I wrote a while back that I never set to \"active\". It's called E","slug":"2003-06-16-Added-a-snippet-DHTML-ImageButton-server-control"},{"title":"Things that make you go...","description":"Visual Studio .NET has not been my friend lately.\n\nLast week, ASPNET was having issues - taking up to 4 minutes to compile a (relatively) small projec","slug":"2003-06-16-Things-that-make-you-go"},{"title":"WinXP wipe","description":"So, after my wah-wah yesterday about Visual Studio, I was looking thru my hotmail account and realized that they offer mobile services. Hey! I've got ","slug":"2003-06-17-WinXP-wipe"},{"title":"Corporate Blogs Catching on","description":"Corporate Blogs Catching on\n\nIt's like a plague. I have some unmanned Tripod sites that sent the \"webmaster\" (yours truly) an email detailing how some","slug":"2003-06-23-Corporate-Blogs-Catching-on"},{"title":"Object ref....","description":"Heh - I get more traffic here and there  from a post I made a while back that had the words \"Object reference not set....\" you know, you've seen it.\n\n","slug":"2003-06-23-Object-ref"},{"title":"WORA...log4net","description":"Luke Blogs of the dream of WORA.\n\nSlightly more interesting to me at this point, tho, is his experiences with log4net, the popular .NET alternative to","slug":"2003-06-26-WORA-log4net"},{"title":"So VB.NET just ain't that bad after all.","description":"Hit a new \"milestone\" in my current project today, at the same time really starting to understand where the term \"over-engineering\" is founded - of co","slug":"2003-06-30-So-VBNET-just-aint-that-bad-after-all"},{"title":"Comment Reply","description":"Helena asks:\nHelena\nPosted @ 7/1/2003 3:39 AM\nHello!\nI'm experiencing the same problem!\nHave you been able to solve it??\n\nI sure did solve it! Thanks ","slug":"2003-07-01-Comment-Reply"},{"title":"Robert Sindall","description":"Robert Sindall has posted a VB.NET Version of my Story on Interactive About Pages using Reflection in ASP.NET.\n\nThanks, Robert! For the VB.NET version","slug":"2003-07-06-robert-sindall"},{"title":"v1.1.4322 w/o VS.NET 2003","description":"I just installed v1.1.4322 of the dotnetfx today, bacause it's looking like the nifty tools that I'm starting to see are all being built with this ver","slug":"2003-07-08-v114322-wo-VSNET-2003"},{"title":"Comment Reply","description":"Frans Says, in comments:\nYou can buy the upgrade for vs.net 2003 for 29$ even if you have a vs.net 2002 you got with an MSDN subscription that is no l","slug":"2003-07-09-Comment-Reply"},{"title":"Managed Quake II? swell.","description":"Nice. ...Must...focus...on work...\nFrom Brad. Interesting…\nThe thing that sold Windows as a viable gaming platform for most people was the appearance ","slug":"2003-07-11-Managed-Quake-II-swell"},{"title":"Yeah, it's swell...","description":"Andrew : Ya just had to post that, didn't ya!\n\nOf course I did! First, Quake II is one of my favorite games (right up there with Duke Nukem:)...I have","slug":"2003-07-11-Yeah-its-swell"},{"title":"nyt hackers","description":"NYT: Hackers Hijack PC's for Sex Sites\n\n...since the hijacked machines download the pornographic ads from a single Web server. According to the comput","slug":"2003-07-11-nyt"},{"title":"I just made it to Redmond.","description":"I just made it to Redmond. Big thanks to Jim Ross, MVP for giving me a ride to my hotel. gotta go!","slug":"2003-07-14-made-it"},{"title":"Finally, my upgrade!","description":"I haven't blogged for a while, I'm on an extended Monday &lt;g&gt;...but anyhoo I just ordered by upgrade to VS.NET Ent. Architect 2003. It sucks that","slug":"2003-07-23-Finally-my-upgrade"},{"title":"WhoIs, and my first WinForms Project","description":"Yesterday I picked up my first Windows Forms project.\n\nI think it should be pretty lightweight -> it's going to be a data entry app for \"API Headers\",","slug":"2003-07-23-WhoIs-and-my-first-WinForms-Project"},{"title":"AcceptChanges()","description":"Okay, I'm about to show a little of my ignorance here, but that's okay - at least I'm blogging again.\n\nI just tracked down a bug in some software I wr","slug":"2003-07-30-AcceptChanges"},{"title":"Mission Possible","description":"So how's about a project I haven't goofed up yet?\n\nI started to make a little headway on the UI of Miny, my first WinForms project. Miny is the name g","slug":"2003-07-30-Mission-Possible"},{"title":"From the Trenches...","description":"Alex Lowe says:\n?My motto: You've got to know someone's pain to make it go away.\n\nAdding to others who have stated it, I'd like to congratulate Alex L","slug":"2003-08-01-From-the-Trenches"},{"title":"Hits from a survival guide.","description":"Too funny. I try to post mainly .net related findings, and enjoy relatively low traffic here other than the occasional google or yahoo search on \"obje","slug":"2003-08-05-Hits-from-a-survival-guide"},{"title":"Mono","description":"Wow. This is something I could have sworn Scoble would post. Are ya fallin off, buddy? Anyways, from Microsoft-Watch:\n\nMicrosoft Watch: What's the fut","slug":"2003-08-06-Mono"},{"title":"Testing geourl","date":"2003-08-21T12:30:00.000Z","description":"just a lil ping!ping!","slug":"2003-08-21-Testing-geourl"},{"title":"moving to .Text","date":"2003-08-21T09:00:00.000Z","description":"\nSo I decided to move the location of my blog, using dotText. I was going to wait for a while, but the Image gallery feature has me sold. Sorry, Chris","slug":"2003-08-21-moving-to-.Text"},{"title":"Got an importer.","description":"I have a project that requires that I convert a flat FoxPro Database to a 'normalized' Sql Server database. So far, I've gotten the foxpro data into S","slug":"2003-08-23-Got-an-importer"},{"title":"flat -> normal shudder","description":"Still posting from infiniblog...\n\nI've been sick for the past few days. I hate being sick, it makes me delerious (sp?). Even worse, I'm currently work","slug":"2003-08-25-flat-normal-shudder"},{"title":"Coming real soon...","description":"I intend to use this blog engine more and more, but I've run into a snag that has held me back a bit - I don't know what the ParentID is supposed to b","slug":"2003-09-06-Coming-real-soon"},{"title":"No command-line proxy for you, buddy.","description":"Oh boy. Another “Object Reference” exception. I tried to create a proxy to this here webservice and insert an entry from a simple command line program","slug":"2003-09-09-No-command-line-proxy-for-you-buddy"},{"title":"System.Net.WebProxy.GetDefaultProxy()","description":"I couldn't figure out why the remote posting thing wasn't working like I wanted it to. Well, the examples that I looked at last nite failed to outline","slug":"2003-09-09-System-Net-WebProxy-GetDefaultProxy"},{"title":"thanks.","date":"2003-09-09T23:00:00.000Z","description":"I want to say thanks to those who have given me feedback on a previous post. It's given me a little bit more insight into this beast called SqlServer.","slug":"2003-09-09-thanks"},{"title":"ImageLists","description":"Looks like Marc is having trouble with sealed ImageLists.\nI've been working on my first Windows Forms project and I'm using the same ImageList through","slug":"2003-09-10-ImageLists"},{"title":"added emoticons :)","description":"I've recently added emoticons 😘 to my .Text blog. If you could see the code, it might look familiar. Heh, that was pretty easy. I did make a change o","slug":"2003-09-10-added-emoticons"},{"title":"geourl","description":"I just added geoUrl to my blog. I don't know why I didn't thing to do this before! I just have it pointing to my personal blog that has the correct ta","slug":"2003-09-10-geourl"},{"title":"oops.","description":"perhaps I should take a little more time to fix the emoticons","slug":"2003-09-10-oops"},{"title":"test","description":"blah!! 😄\n\nedit more","slug":"2003-09-10-test"},{"title":"I remember.","description":"9/11. I was at home that day, my son wasn't born yet, and I saw the whole thing televised after my (ex) girlfriend's crazy best friend told us that Am","slug":"2003-09-11-I-remember"},{"title":"Wow. It's a website. (part deux)","description":"Me: Hey, Tina - you wanna see what I did today?\nTina: No, I looked at a computer screen for too long today. It was 4 hours.","slug":"2003-09-11-Wow-Its-a-website-part-deux"},{"title":"Paying it forward","description":"In response to a post I made about VS.NET 2002 failing to open connections with Sql Server, Roman says:\n\n\n\nI have just found solvation. Installing MDA","slug":"2003-09-12-Paying-it-forward"},{"title":"technology is like","description":"\nSo I'm doing some work with typed datasets right now that is really souring my experience with VS.NET 2003.\n\nI'm using the same technique that I used","slug":"2003-09-19-technology-is-like"},{"title":"Intellisense problem solved.","description":"For anyone else who might have run into Intellisense weirdness, I found that just 'touching' the file that was generated by vs.net for the dataset and","slug":"2003-09-23-Intellisense-problem-solved"},{"title":"Note to the Windows Forms team","description":"Working with windows forms sucks.\n\nEspecially if you're coming from the much more approachable asp.net side. I have state, but simple things like pre-","slug":"2003-09-24-Note-to-the-Windows-Forms-team"},{"title":"Archives","description":"here September, 2003(16)\nthere September, 2003(14)\nand the internal one, September, 2003(34)\nhehe, you can't see how big of a dope I am on the interna","slug":"2003-09-26-Archives"},{"title":"More cross-posting shennanigans.","description":"I think I'm going to play with .Text a little bit to allow cross-posting from here to there using w.Bloggar and the MetaBlog API.\n\nPerhaps there are s","slug":"2003-10-01-More-cross-posting-shennanigans"},{"title":"Thanks Darren...Show us your-Regex!","description":"The place that I work uses what we call index numbers (they're not really numbers per se...) that are based on API numbers (which are usually numbers)","slug":"2003-10-01-Thanks-Darren-Show-us-your-Regex"},{"title":"ATM - Galaga","description":"I had a dream last nite that I was going to an ATM to get some cash. When I was at the terminal, on the opposite side of the English/Espanol options t","slug":"2003-10-06-ATM-Galaga"},{"title":"A different OS this time...","description":"This time I'm like the PalmOS. I hope that's not bad :)\n\nAt any rate, I love my Palm Handheld.\nWhich OS are You?","slug":"2003-10-09-A-different-OS-this-time"},{"title":"New Skin, new Gallery!","description":"Thanks to Donny Mac for pointing me to a new skin for here. Also thanks to Julien Cheyssial for creating the initial one.\n\nI changed the colors from o","slug":"2003-10-10-New-Skin-new-Gallery"},{"title":"Hannah Henson","description":"My girlfriend Tina just pointed me to a site that a friend of hers has put up - Hannah Henson is a young lady who was diagnosed with osteosarcoma earl","slug":"2003-10-11-Hannah-Henson"},{"title":"Simple Scrolling added to my blog","description":"I added a scroller over here - just some custom javascript. I wanted to get it working - it looks great on IE, I can't say the exact same for mozilla ","slug":"2003-10-14-Simple-Scrolling-added-to-my-blog"},{"title":"Test from MetaBlog/w.bloggar","description":"This is just a little test ping.\n\n-= Currently Jammin: Chop Suey - System Of A Down -  (03:17) :=-","slug":"2003-10-16-Test-from-MetaBlog-wbloggar"},{"title":"sigh of relief","description":"Thanks, Scott. :)","slug":"2003-10-20-sigh-of-relief"},{"title":"For anyone who wants the Lighty skin to look a little better in Mozilla...","description":"Go to the Admin section of your blog, and in the “Custom CSS Selectors” textbox add:\nmain {\nmargin-left:200px;\npadding:0px 20px 0px 0px;\nwidth: 580px;","slug":"2003-10-21-For-anyone-who-wants-the-Lighty-skin-to-look-a-little-better-in-Mozilla"},{"title":"Somebody likes the blue Lighty.","description":"Jeff Julian pinged me this morning and asked if he could use the version of Lighty that I hacked up after Julien Cheyssial (that's weird :)released hi","slug":"2003-10-21-Somebody-likes-the-blue-Lighty"},{"title":"For anybody who's running .Text...","description":"Jeff Julian  has put up a couple of skins at http://www.geekswithblogs.com/TextSkins .","slug":"2003-10-23-For-anybody-whos-running-Text"},{"title":"My Thursday Night","description":"\nPapa John's pepperoni and ham (with the special garlic sauce)\ncold beer\nworking software\nnow if only the Yankees can pull off 3 more points...this is","slug":"2003-10-24-My-Thursday-Night"},{"title":"This *is* a cross-post from .Text.","description":"It seems that cross-posting has become a cool feature since other, more respected developers have released new versions of their prospective blogging ","slug":"2003-10-27-This-is-a-cross-post-from-Text"},{"title":"I don't speak German, but...","description":"\nThis post reinforces that a picture is worth 10,000 words.","slug":"2003-10-28-I-dont-speak-German-but"},{"title":"Singing the praises of the ASP.NET Version Switcher.","description":"I'm putting some of the finishing touches on my first winforms project, so I decided to try out some code on an app that I wrote over a year ago today","slug":"2003-10-31-Singing-the-praises-of-the-ASPNET-Version-Switcher"},{"title":"May be changing servers soon...","description":"I may have to change servers...it looks like another app that lives here is timing out a lot and I want to be able to make sure it's not my blog's fau","slug":"2003-11-01-May-be-changing-servers-soon"},{"title":"Seeing the Matrix Manana","description":"I just got my tickets to see The Matrix : Revolutions online...I'm one of the fortunate few that get to see this on the BIG screen: IMAX baby! :P","slug":"2003-11-04-Seeing-the-Matrix-Manana"},{"title":"Exception Management","description":"I've been using the Exception Management Application Block for quite some time now, and for general purpose it's great. Especially when I need some de","slug":"2003-11-14-Exception-Management"},{"title":"Tomorrow's my birthday.","description":"I'll be 23. :)","slug":"2003-11-14-Tomorrows-my-birthday"},{"title":"Ever heard of role-based security?","description":"I'm sorry, Frans - this did make me chuckle a little bit, tho:\nWell... ever heard of role-based security? Rob Howard hasn't obviously.\nRob Howard – Me","slug":"2003-11-18-Ever-heard-of-role-based-security"},{"title":"Hannah Henson","description":"Our friend Hannah passed away yesterday.\nVanessa: thank you for your comment, indeed Hannah was an inspiration to us all. She had courage and faith un","slug":"2003-11-19-Hannah-Henson"},{"title":"I want a new...","description":"...way to post to my weblogs. Maybe you can help me out.\nObjective: Create a desktop application that will enable posting entries to a weblog.\nTechnol","slug":"2003-11-25-I-want-a-new"},{"title":"Blogert","description":"Thanks to comments from my previous post, I did snag a copy of Blogert.\nJust like I thought, it's almost everything that I wanted, but I want a\ncouple","slug":"2003-11-26-Blogert"},{"title":"What's in a name?","description":"In my comments here, Michael Slater says I should try out zempt for my blog-editing pleasure...well, I went to the site and thanks for the suggestion,","slug":"2003-12-03-Whats-in-a-name"},{"title":"Posting code snippets from the desktop...","description":"Scott Mitchell told me:\nFeature request: you will be my hero if your blog software can display code snippets in a color coding like in VS.NET. And if ","slug":"2003-12-04-Posting-code-snippets-from-the-desktop"},{"title":"posting from the desktop...","description":"See? I'm not the only one.","slug":"2003-12-04-posting-from-the-desktop"},{"title":"It has begun or Does size really matter?","description":"I finally decided on a name for my project - PostModern. I had already gotten\nsyntax highlighting worked out, but I ended up using a different compone","slug":"2003-12-10-It-has-begun-or-Does-size-really-matter"},{"title":"\\[deactivatedstyle\\]","description":"ugh. looks like the best way to do this is with \\[font\\] tags. eeww.\n","slug":"2003-12-10-deactivatedstyle"},{"title":"Local DasBlog","description":"Wow. I realized that I needed some guidance on how to implement the MetaWeblog API and thought, hmm, doesn't that dasBlog jobby do cross-posting with ","slug":"2003-12-12-Local-DasBlog"},{"title":"sorry to my 2 readers","description":"But I need to test out how my new syntax highlighting code is going to look in an aggregator. No offense, I hope.\n1using System;\n2\n3namespace Highligh","slug":"2003-12-17-sorry-to-my-2-readers"},{"title":"PostModern Crossroads","description":"Okay, I'm pretty solid on the HtmlEditor that I'm going to use for my little side\nproject. It's a sweet editor. Honestly, it has more features than I ","slug":"2003-12-24-PostModern-Crossroads"},{"title":"-2004","description":"Happy New Year everybody. :)","slug":"2003-12-31-2004"},{"title":"Blatant \"Me Too\" Post","description":"Jason Alexander posted recently about moving nGallery to VaultPub.\nI'm hosting my little slow-going side project there too (hence the title:) It's goi","slug":"2004-01-03-Blatant-Me-Too-Post"},{"title":"HtmlComponent.Document.Selection","description":"I finally figured out how to use the Document.Selection of Nikhil's HTML Component. I was looking for Document.InsertHtml which eluded me until today.","slug":"2004-01-06-HtmlComponent-Document-Selection"},{"title":"Come back to ASP.NET for the first time.","description":"Today I had to bring up a previous project that I had done in asp.net and\nmake sure that it would work well if installed to an end-user's machine for ","slug":"2004-01-15-Come-back-to-ASPNET-for-the-first-time"},{"title":"Guess who's also an MVP?","description":"Yours truly! (that would be me) :)\n\nCongratulations to everyone else who earned this honor.","slug":"2004-01-21-Guess-whos-also-an-MVP"},{"title":"It's coming...","description":"\nBTW, this is yet another code-when-I-have-a-free-time program :P","slug":"2004-01-23-Its-coming"},{"title":"The internet is shit.","description":"\"4 of 11....Fiction\nis self-perpetuating.\"","slug":"2004-01-23-The-internet-is-shit"},{"title":"Public Apology","description":"I'm sorry, reader.\nI haven't posted to this thing in almost 2 months, and I'm sure that both of you are quite upset at me. So what's been going on wit","slug":"2004-03-11-Public-Apology"},{"title":"Movin on up...","description":"Tina and I just finished moving the last of our stuff from the old apartment\nto the new one.\nWe've almost got everything unpacked - I like it here. Th","slug":"2004-03-14-Movin-on-up"},{"title":"I had to blog this.","description":"I've been using Mozilla FireFox as my default browser for a couple of weeks. I love it - for the most part. A lot of people don't design for standards","slug":"2004-03-16-I-had-to-blog-this"},{"title":"That's what I'm talkin bout!","description":"Julien\nEllie, you rock. In response to all the WinForms hubub yesterday, I asked\nfor a higher limit on the file selection dialog (you can only select ","slug":"2004-03-17-Thats-what-Im-talkin-bout"},{"title":"What do you want from WinForms?","description":"Like to hear my feedback? I'd like a file dialog that lets me\nselect more than 200 files at a time. With the people and companies I work with,\nit is a","slug":"2004-03-17-What-do-you-want-from-WinForms"},{"title":"I feel ya.","description":"Big\nTime. I've even talked about it before.\nI'm really thankful that Tina listens to the boring .NET stuff I talk about -\nshe even listens to me talk ","slug":"2004-03-19-I-feel-ya"},{"title":"last try I promise.","description":"Sorry ScottW.\nLet's hope the third time is the charm.","slug":"2004-03-20-last-try-I-promise"},{"title":"my first desktop cross-post","description":"that's a little upsetting :(","slug":"2004-03-20-my-first-desktop-cross-post"},{"title":"This sucks.","description":"My\ncousin finally got a weblog but I can't subsribe to it!\nI sent these people an email asking them to at least include permalinks and a\npublic rss fe","slug":"2004-03-22-This-sucks"},{"title":"Drag and Drop Urls in Windows Forms","description":"So I wanted to allow for this, right? What if I find something on the net\nthat just begs me to post it, and I want to use the url as the source for my","slug":"2004-03-24-Drag-and-Drop-Urls-in-Windows-Forms"},{"title":"How did I format that code?","description":"Nick Berardi asks:\n\n  How did you format this code, I really like that.\nIt was pretty easy, I used some code that I modified from the original\nSquishy","slug":"2004-03-24-How-did-I-format-that-code"},{"title":"Madrid","description":"My High School friend Aleida has been living in Spain for a while now. She\nsends emails every now and then just to say how things are going - I hope s","slug":"2004-03-29-Madrid"},{"title":"Hell freezes over","description":"I thought this may be useful in the future... :)\n","slug":"2004-04-03-Hell-freezes-over"},{"title":"Imitation vs. Innovation","description":"I'm ashamed of myself.\nI finished my first windows forms project a few months ago - it's an internal\nproject that will never be released to the public","slug":"2004-04-08-Imitation-vs-Innovation"},{"title":"Freakin a(tof)!","description":"I had some very humble console app beginnings in C++. Ya know, \"cash\nregister\" dos-like programs, completely keyboard driven.\nHowever, my beginnings h","slug":"2004-04-09-Freakin-atof"},{"title":"HtmlComponent","description":"I've needed this link ( http://www.nikhilk.net/Entry.aspx?id=11\n) a few times, so I thought I'd give it a little google juice so I could find it\neasie","slug":"2004-04-21-HtmlComponent"},{"title":"holla!","description":"","slug":"2004-04-27-holla"},{"title":"Achooo!","description":" &lt;mumble&gt;viral\nmarketing...&lt;/mumble&gt; :)\nFREE XDN\n  Professional for .NET Bloggers during May 2004Mike Schinkel, president of Xtras.Net,\n  ","slug":"2004-04-30-Achooo"},{"title":"Links for Monte Carlo Simulations","description":" http://polymer.bu.edu/java/java/montepi/MontePi.html \nIntroduction to Monte\nCarlo Methods (online textbook)\n Molecular Monte\nCarlo HomePage","slug":"2004-04-30-Links-for-Monte-Carlo-Simulations"},{"title":"I can ping everything now.","description":"Okay, not everything, but at least www.weblogs.com and blo.gs.\nI already had some of the code in place, but then I came across an example by\nCharles C","slug":"2004-05-01-I-can-ping-everything-now"},{"title":"er...maybe I DO need to get out more often.","description":"Am I the last one to notice a certain Microsoft Blogger's mug at\nthe top of www.weblogs.com\n?","slug":"2004-05-01-er-maybe-I-DO-need-to-get-out-more-often"},{"title":"Okay, That was pretty cool.","description":"\n  .NET\n  Reflector 4.0.1.0\n  Click: Help | Check for Updates | Yes.","slug":"2004-05-11-Okay-That-was-pretty-cool"},{"title":"Office 2003 Faces","description":"I thought I linked to this before, but I guess I was wrong.\nHere's some google juice for those Office 2003\nFaces.","slug":"2004-05-13-Office-2003-Faces"},{"title":"What's the point of comment spam?","description":" Especially when the links don't point anywhere?\nI'm finding this mildly annoying, and I'm sure there's some of you out there who\nare getting bombarde","slug":"2004-05-22-Whats-the-point-of-comment-spam"},{"title":"The Tao of Programming","description":"\n  1.2\n  The Tao gave birth to machine language. Machine language gave birth to the\n  assembler.\n  The assembler gave birth to the compiler. Now there","slug":"2004-05-27-The-Tao-of-Programming"},{"title":"Starting a conversation - I want to hear your opinion.","description":"I wanted to ask for your opinion. I've been building this little wysiwyg\nblog-posting tool for a little bit. I call it PostXING, and I'm using it righ","slug":"2004-06-03-Starting-a-conversation-I-want-to-hear-your-opinion"},{"title":"Searching for Adam Sills","description":"Hey, Adam, if you're reading this, drop me a line. I can't\nfind a way to contact you, so I guess this is the next best thing.","slug":"2004-06-04-Searching-for-Adam-Sills"},{"title":"All quiet...","description":"So I haven't posted in a while. See, on Monday, my life changes. Exactly\nhow, I'm not sure yet.\nI'm going to family court to get joint custody of my s","slug":"2004-06-11-All-quiet"},{"title":"Another personal post","description":"So I had the first weekend alone with my son, Ethan, this past weekend. It\nwas awesome! What a perfect father's day gift - being able to actually spen","slug":"2004-06-22-Another-personal-post"},{"title":"The road to enlightenment","description":"Earlier this year I started using NUnit to see what all the fuss was about. I\nstarted on a subset of an application that I'm working on, using it for ","slug":"2004-06-24-The-road-to-enlightenment"},{"title":"THINGS YOU WISH YOU COULD SAY AT WORK","description":"Another one of those funny emails that should be shared....1. Ahhh...I see the fuck-up fairy has visited us again... 2. I don't know what your problem","slug":"2004-07-01-THINGS-YOU-WISH-YOU-COULD-SAY-AT-WORK"},{"title":"Where in the hell have you been?","description":"Short answer: working.\nLonger answer: I've been learning so much lately that my brain hasn't had the\nrest period required to post faithfully to this h","slug":"2004-07-27-Where-in-the-hell-have-you-been"},{"title":"In case you didn't know,","description":"CodeSmith r00l3z.\nI recently did my semi-annual \"house cleaning\", where instead of just getting\nrid of all the accumulated crap I've got on my dev box","slug":"2004-08-10-In-case-you-didnt-know"},{"title":"url123.com","description":"Okay, so I haven't posted for a while and you don't care. Established.\nBut you've gotta check this out, for real. Francesco Sanfilippo has been puttin","slug":"2004-08-17-url123com"},{"title":"Added New Articles","description":"You can find them here or there.\nOne of them was really just a VB.NET version of another article that I wrote\na while back that was left in the commen","slug":"2004-09-01-Added-New-Articles"},{"title":"Embrace and Extend: MikeDub's IUI article","description":"I've been doing a lot of that lately (embracing and\nextending). So I'm reading thru Mike's latest article, thinking how can I apply this\nto an applica","slug":"2004-09-11-Embrace-and-Extend-MikeDubs-IUI-article"},{"title":"CodeSnip: Getting Currently Playing info from Windows Media Player using the blogging power toy.","description":"I don't know whom this would benefit but someone building a blog posting tool\nfor the desktop, but anyway here's the code that I converted from the js","slug":"2004-09-23-CodeSnip-Getting-Currently-Playing-info-from-Windows-Media-Player-using-the-blogging-power-toy"},{"title":"Happy Birthday, G!","description":"Well, it looks like Gino's enjoying his day...\nGlad to hear that - you deserve it you old bastard ;) Oh, and btw, I found\nthis out b/c bloglines has a","slug":"2004-09-28-Happy-Birthday-G"},{"title":"How Jedi Are you?","description":":: how jedi are you? ::","slug":"2004-10-06-How-Jedi-Are-you"},{"title":"I see ya...","description":"\nwhut?","slug":"2004-10-12-I-see-ya"},{"title":"PostXING Released.","description":"I finally released my little\nhome-hacked tool to the wild, Thanks to Darren and his awesome Project Distributor.\nPostXING was originally\njust somethin","slug":"2004-10-22-PostXING-Released"},{"title":"How I use the new \"preview template\" in PostXING","description":"It starts off (defaults) using something like the following (newlines added\nfor readability):\n&lt;html&gt;&lt;head&gt;&lt;link rel='stylesheet'\nhref='","slug":"2004-10-28-How-I-use-the-new-preview-template-in-PostXING"},{"title":"ProjectDistributor rox your sox.","description":"I just can't pimp Darren's new\nProjectDistributor enough.\nLook at the ideas\nthis guy comes up with. Every time I chat with him, something new is comin","slug":"2004-11-04-ProjectDistributor-rox-your-sox"},{"title":"Stupid error messages.","description":"I could have sworn I saw this on someone else's blog recently, but I just\nencountered a pretty dumb error from a hiccup on this very server.\nI've rece","slug":"2004-11-04-Stupid-error-messages"},{"title":"test","description":"Sorry - sometimes it's necessary, tho :)","slug":"2004-11-11-test"},{"title":"Happy Birthday to me","description":"I'm 24 today :)","slug":"2004-11-15-Happy-Birthday-to-me"},{"title":"Bring Back KLOL!","description":" http://bringbackklol.com/index.php\n\n  http://www.rock101.info/speakout/\n  Did you wake up to Spanish music? Clear Channel has\n  decided to make a for","slug":"2004-11-19-Bring-Back-KLOL"},{"title":"CODESNIP - Creating C# like indexers in VB.NET","description":"Well, kind of :) I have a collection that I want to access in C# with an\nindexer, the only problem is that the collection is written in VB.NET as part","slug":"2004-11-19-CODESNIP-Creating-C-like-indexers-in-VBNET"},{"title":"Free Icons at EggHeadCafe","description":"I was doing my early morning googling and came across this - a set of free icons in the WinXP\ncustom format. Really nice if you want to add that touch","slug":"2004-11-19-Free-Icons-at-EggHeadCafe"},{"title":"I've got a little pirate.","description":"My son, Ethan, has started pretending to be a pirate sometimes on the\nweekends that he visits me.\nThis past weekend, he got a sticker from Kroger's an","slug":"2004-11-24-Ive-got-a-little-pirate"},{"title":"We've come a long way, baby.","description":"From 1954 Popular Mechanics:\n\n[ Currently Playing : Low - Foo Fighters - One by One (04:28)\n]","slug":"2004-11-24-Weve-come-a-long-way-baby"},{"title":"Fact check first, Christopher","description":"Ouch. Looks like I should find out if a picture I post to my blog is\nauthentic or not before posting :$\n\nRobert Scoble\n  This is a well-known hoax. I ","slug":"2004-11-25-Fact-check-first-Christopher"},{"title":"Hey Scoble","description":"By the way, Scoble, I\ndo read your blog...I just can't remember everything that gets\nposted there! Don't you remember posting 60 - 70 items in one nig","slug":"2004-11-26-Hey-Scoble"},{"title":"IBlogExtension","description":"Bob wants\nto see some integration of RssBandit and PostXING.\nThis was an idea I had really early on simply because a lot of the features\nin PostXING w","slug":"2004-11-30-IBlogExtension"},{"title":"LoreSoft.com","description":"I feel like I've hit .net developer's gold.\nI was searching for a spell checking component and came across this site (with the help of Don Smith). Not","slug":"2004-11-30-LoreSoft"},{"title":"Posted too soon?","description":"It looks like I created (or rather raised an awareness to) a little\nsnafu on ProjectDistributor :/\n\nThe latest release of PostXING didn't upload prope","slug":"2004-11-30-Posted-too-soon"},{"title":"Does this mean I've made it?","description":"It took nearly two years, but it looks like I've posted something interesting\nenough to show up on the Daily Grind.\nIt's linked over there as\nopposed ","slug":"2004-12-01-Does-this-mean-Ive-made-it"},{"title":"Prince of Persia 2: the Warrior Within","description":"Damn.\n\nThat's right, I said Damn.\n\nIt looks and feels so much like the first one (which I beat about 6 or 7\ntimes without getting tired of it) but Ubi","slug":"2004-12-02-Prince-of-Persia-2-the-Warrior-Within"},{"title":"Wes, you Rock.","description":"Forreal.\nI had been using a different, \"static\" library to do syntax highlighting\nbefore...Now, if you don't like how a certain language is configured","slug":"2004-12-03-Wes-you-Rock"},{"title":"Wooohooo!","description":"Darren went and fixed my Project Distributor blunder...now you\ncan get the latest version of PostXING from the place\nit was originally released.\nThank","slug":"2004-12-03-Wooohooo"},{"title":"Project Distributor: the chicken AND the egg!","description":"Well, it looks like Darren decided to confuse the\nhell out of me and make his Project\nDistributor available for download at guess where? Project Distr","slug":"2004-12-07-ProjectDistributor-the-chicken-AND-the-egg"},{"title":"Southpark Me.","description":"South Park\nMe:\n\n(which is not too far away from) Real Me:\n\nNo, I don't work for Microsoft, but I am wearing this shirt today. I need a\nshave, don't I?","slug":"2004-12-13-Southpark-Me"},{"title":"Paul D. Murphy's Google Juice research","description":"Paul is trying to find out what effect blogs have on google juice. He's\ndecided to coin the term 'consummate asshole' \"because it has very little\ncomp","slug":"2004-12-16-Paul-D-Murphys-Google-Juice-research"},{"title":"RE: Cross-posting - A new trend?","description":"I started to make this a reply in Shawn's\ncomments, but decided it was getting too long-winded to be a comment. You\nget a post, Shawn. In his comments","slug":"2004-12-20-RE-Cross-posting-A-new-trend"},{"title":"RE: IBlogExtension","description":"\n  Bob wants to\n  see some integration of RssBandit and PostXING.\n  This was an idea I had really early on\n  simply because a lot of the features in P","slug":"2004-12-22-RE-IBlogExtension"},{"title":"A couple of releases","description":"So I released a new version\nof PostXING , adding support for the new IBlogExtension plugin I was\ntalking about the other day. Oh, I released the\nBlogT","slug":"2004-12-30-A-couple-of-releases"},{"title":"IPlugin implemented.","description":"So I ended up working out a method to load plugins - it's a hybrid of Royo's\nExtensibility\nApplication Block and the method used by RssBandit. Now, I ","slug":"2004-12-31-IPlugin-implemented"},{"title":"New customizable version of BlogThisUsingPostXINGPlugin available","description":"This new version of the\nBlogThisUsingPostXINGPlugin handles customizing the transform used to output\ninto a new Post in PostXING. For\nexample, say I w","slug":"2005-01-04-New-customizable-version-of-BlogThisUsingPostXINGPlugin-available"},{"title":"RE: new domain name for Aceh Aid","description":"\n  www.AcehAid.org\n  What do they need? MONEY of course to pay for the supplies going\n  into Aceh. Macs,\n  lots of macs and digital cameras and more.\n","slug":"2005-01-04-RE-new-domain-name-for-Aceh-Aid"},{"title":"Set your FileAccess!","description":"When I was working on the latest release of the BlogThisUsingPostXINGPlugin,\nI kept running into file access issues.\n\nThe whole thing was an excersize","slug":"2005-01-04-Set-your-FileAccess"},{"title":"How bad do you want spellchecking?","description":"Well, I've implemented it. I figured out a way to have a user-defined\ndictionary location (very simple implementation), but now I'm still facing the\nd","slug":"2005-01-05-How-bad-do-you-want-spellchecking"},{"title":"RE - MVP Again OR Here Come the \"MeToo's\"","description":"\n  I just found out that I got the nod for Microsoft MVP again for 2005.\n  I was hoping that would be the case, because I really enjoyed going to the ","slug":"2005-01-05-RE-MVP-Again-OR-Here-Come-the-MeToos"},{"title":"Extensibility Application Block - a review of an implementation.","description":"Royo asks:\n\n\n  I'm interested to know whether you found my Extensibility application block\n  useful, or if you had to make many changes to it to make ","slug":"2005-01-06-Extensibility-Application-Block-a-review-of-an-implementation"},{"title":"RE: I am Nerdier than Paul","description":"I am:\nNot nerdy, but definitely not hip.\n","slug":"2005-01-06-RE-I-am-Nerdier-than-Paul"},{"title":"Using the NetSpell plugin for PostXING.","description":"With the latest release\nof PostXING, a plugin architecture\nhas been added to allow for external extensions such as the new NetSpellPlugin that\nadds sp","slug":"2005-01-06-Using-the-NetSpell-plugin-for-PostXING"},{"title":"RE: Couple of feature requests","description":"\n   Couple of feature requests posted by Bob\n  Yexley on 1/7/2005 12:02:04 PM : Hey nice work on the latest\n  version. Spell checking works very nicel","slug":"2005-01-07-RE-Couple-of-feature-requests"},{"title":"A new feature...","description":"...for PostXING that I should\nhave added a long time ago. It only took roughly 40 lines of code (including\ngratuitous whitespace). I'll give you a hin","slug":"2005-01-11-A-new-feature"},{"title":"New PostXING release.","description":"I've uploaded a new release\nof PostXING to ProjectDistributor. This release adds\nthe ability to Load or Save a post as a .htm file, as well as managin","slug":"2005-01-12-New-PostXING-release"},{"title":"RE: New PostXING release.","description":"\n  I've uploaded a new release of\n  PostXING to ProjectDistributor.\n  This release adds the ability to Load or Save a post as a .htm file, as well\n  a","slug":"2005-01-12-RE-New-PostXING-release"},{"title":"IBlogExtension, from the other side","description":"I can now use the great IBlogExtension plugins for NewsGator\nto post with PostXING. (with my\nbuilt about 10 minutes ago dogfood version, that is :) Th","slug":"2005-01-13-IBlogExtension-from-the-other-side"},{"title":"New PostXING release","description":"\nI've gone ahead and uploaded a new build of PostXING. I\nextended the plugin architecture a little bit to allow for posting to non-.Text\nblog engines ","slug":"2005-01-17-New-PostXING-release"},{"title":"Halo (both of 'em)","description":"I've been playing Halo 2 recently, and I got to a part that reminded me why I\nlost interest in the first one.\nOnce you get to a certain part of the ga","slug":"2005-01-21-Halo-both-of-em"},{"title":"Score for CS Blogs","description":"I feel like a kid in one of those old milk commercials - you may\ntry to com...ment $p4|\\/| me, on....line pok...er, but my blog is running CS::Blogs, ","slug":"2005-01-21-Score-for-CS-Blogs"},{"title":"Sun's Open letter to IBM.","description":"I am not an expert in this area. Not even close. Wouldn't even call myself an\namateur. But I had to stop reading the\nletter when he says \"It's the\nmos","slug":"2005-01-24-Suns-Open-letter-to-IBM"},{"title":"New PostXING coming soon","description":"With the help of Laurent Kempé,\nI've traced down a bug in the PostXING FTP library (or rather my handling of it)\nand ended up changing the underlying ","slug":"2005-01-29-New-PostXING-coming-soon"},{"title":"RE: This is gonna piss some people off...","description":"\nSo earlier I said \"This is\ngonna piss some people off...\" about the EntLib, right? Well, straight from\nthe developer's mouth:\n\n\n\n  Scott\n  Densmore\n ","slug":"2005-01-29-RE-This-is-gonna-piss-some-people-off"},{"title":"This is gonna piss some people off...","description":"\nGoing to download the spankin new Enterprise\nLibrary, and before you can download you're presented with this:\n\nEnterprise Library\nYour registration i","slug":"2005-01-29-This-is-gonna-piss-some-people-off"},{"title":"RE: /aiCAPTCHA article FAQ","description":" &lt;snip&gt;Q: You mean you didnt kill 200K people or change the tilt of the Earth's axis?\na: not yet &lt;/snip&gt;\n\\[Via rains-N-brawn.com \\]\n\nClass","slug":"2005-02-01-RE-aiCAPTCHA-article-FAQ"},{"title":"-Added-Tabbing","description":"I recently added Tabbing functionality for\nindenting/outdenting (hey, it's a trident term :) in my dogfood version of\nPostXING.\nQuoting has just becom","slug":"2005-02-02-Added-Tabbing"},{"title":"They're pretty useless but...","description":"They're fun anyways.\n\n\nWhich File Extension are You?","slug":"2005-02-07-Theyre-pretty-useless-but"},{"title":"Asian \"Just Lose It\"","description":"euiyun's\nXanga Site - 2/8/2005 9:41:55 PM\n\nAlways good to see a bunch of Asians \"go crazy\". (ahahahahah!)\nBonus: It looks like it was filmed in good o","slug":"2005-02-09-Asian-Just-Lose-It"},{"title":"Updated my engine.","description":"Well, thanks to Steven's\npost .Text's\nMetaWeblog API - Edit Post Error... I am now just a couple of revisions\nbehind the latest incarnation of .Text o","slug":"2005-02-15-Updated-my-engine"},{"title":"BradA at the Houston .NET UG","description":"Although he only talked about high-level stuff (Exception Handling and Memory\nManagement), I think Brad did a pretty good job. I stopped going to the\n","slug":"2005-02-17-BradA-at-the-Houston-NET-UG"},{"title":"Channel 9 guy...","description":"|}34|2 M|2. Scoble,\n\n**1 H4v3 K1|}n4pp3|} y0U|2 p|23C10U5 \"CH4nn3L 9 6Uy\". 1f j00 3v4|2 w4n7 70\n533 H1M 4L1v3 4641n, My |}3M4n|}5 MU57 83 M37 1n fULL.","slug":"2005-02-17-Channel-9-guy"},{"title":"Using OpenSSH tunneling for RealVNC on Windows","description":"I totally geeked out tonight.\n\nI was searching for something else and happened upon a\ntutorial for tunneling VNC on windows, which led me to another a","slug":"2005-03-01-Using-OpenSSH-tunneling-for-RealVNC-on-Windows"},{"title":"PostXING feature requests","description":"Teirnan\nasked for a few features for PostXING. I started to write a comment, but it\ngot too long-winded for a comment. You get a post Sir:\nCan I help ","slug":"2005-03-15-PostXING-feature-requests"},{"title":"My comments are broken...","description":"...at a time when people are actually leaving comments. Balls. Josh - I'm\nchecking the vaultpub repository on a clean directory right now, I probably\n","slug":"2005-03-16-My-comments-are-broken"},{"title":"PostXING's vaultpub works.","description":"This shouldn't have gotten this out of whack, but it did, sorry. I've made\nsure that all of the folders are inherited now, and tested the get latest\nv","slug":"2005-03-16-PostXINGs-vaultpub-works"},{"title":"A little down time...","description":"I'm going to be installing community server here today. There's going to\nbe a little downtime because of that. As if you cared.","slug":"2005-03-17-A-little-down-time"},{"title":"Customer Service Message","description":"This is a message that my boss recently sent to a customer that had an issue\nwith one of our software packages (I don't own it :)\n\n  Brian, in the fin","slug":"2005-03-22-Customer-Service-Message"},{"title":"A little CS hack for the metablog API","description":"Keith told me that\nCSBlogs was returning relative urls for its Metablog API implementation. After I\ninstalled it, I noticed the same thing - so I deci","slug":"2005-03-24-A-little-CS-hack-for-the-metablog-API"},{"title":"Enabling styles in CS","description":"Straight from ScottW, I added\n\n&lt;MarkUp&gt;\n\t&lt;globalAttributes&gt;\n\t\t&lt;class enable = \"true\" /&gt;\n\t\t&lt;align enable = \"true\" /&gt;\n\t\t&lt;styl","slug":"2005-03-24-Enabling-styles-in-CS"},{"title":"Running WebMatrix with a Whidbey Beta installed","description":"I took a chance and installed a CTP of Whidbey on my laptop. Thing is, I\nstill use WebMatrix from time to time for POC stuff for v1.x of asp.net.\n\nPro","slug":"2005-03-26-Running-WebMatrix-with-a-Whidbey-Beta-installed"},{"title":"Re: Here we go!","description":"Congrats, James! Always good to see someone you know catch a deal like\nthis. Too bad there are no comments for me to tell him in his blog :P\nSee for y","slug":"2005-04-01-Re-Here-we-go"},{"title":"RE: We're back!","description":"\n  Well, I woke up this morning and found myself back in Roswell, GA. It seems\n  that the Google trip must have been a\n  dream.\n  Don't you just love ","slug":"2005-04-02-RE-Were-back"},{"title":"Little Tony","description":"I went to go visit with my little (2 1/2 mos) nephew Tony tonight. Here's a\ncouple of pics I snapped on my phone:\n\n","slug":"2005-04-06-Little-Tony"},{"title":"New PostXING release","description":"I've added a small usability feature based on some recent\nfeedback.\nNow, from the Tools -&gt; Options dialog, you can optionally set whether you\nwould","slug":"2005-04-08-New-PostXING-release"},{"title":"Goodbye, Lynn","description":"One of my coworkers, Lynn Coyle, was found dead in his house this morning.\n\nLynn had diabetes. He was kind of an odd character, but he was a good pers","slug":"2005-04-09-Goodbye-Lynn"},{"title":"RE: ObjectDock","description":"\n  Who else out there likes a dock better than the standard windows taskbar? I\n  have been using StarDock's ObjectDock for a\n  few weeks now and I thi","slug":"2005-04-15-RE-ObjectDock"},{"title":"CS::Blogs: allowing anonymous comments","description":"I don't know if this will post with the source, but I've got this link that\nmay save someone the trouble of searching CS forums for an answer: http://","slug":"2005-04-19-CSBlogs-allowing-anonymous-comments"},{"title":"RE: Digital Pontification - Podcast Show Notes (4/21)","description":"I want to second Jason's nomination (below in bold). This morning I was trying to figure out how to port Sql Express data to Sql Server 2000, and Wall","slug":"2005-04-21-RE-Digital-Pontification-Podcast-Show-Notes"},{"title":"ObjectDataSource goodness.","description":"Since there are probably going to be a lot of posts about all things\nWhidbey soon, as people get more and more chance to play with things, I've\ndecide","slug":"2005-04-25-ObjectDataSource-goodness"},{"title":"PSKit - FormView initial thoughts","description":"I've been playing with the Personal Website\nStarter Kit a little bit lately. One thing that I didn't like about it from\nthe start was that the content","slug":"2005-04-29-PSKit-FormView-initial-thoughts"},{"title":"RE: Announcing Subtext, A Fork Of .TEXT For Your Blogging Pleasure","description":"\nAwesome. I had a\nfeeling I was going to see something like this sooner or\nlater.","slug":"2005-05-05-re-announcing-subtext-a-fork-of-text-for-your-blogging-pleasure"},{"title":"On Community Support   give and you shall recieve","description":"\nI use Azureus as my bittorrent client. It has this nifty feature that is\nsimilar to the Updater Application Block that will automatically check for a","slug":"2005-05-12-on-community-support---give-and-you-shall-recieve"},{"title":"PSKit: Replacing that pesky Lorem Ipsum text with dynamic content","description":"\nThe Personal Website Starter Kit is a great resource for getting up and\nrunning with asp.net 2.0 beta. I've been using it to check out some features\n","slug":"2005-05-18-pskit-replacing-that-pesky-lorem-ipsum-text-with-dynamic-content"},{"title":"A couple of PostXING ideas","description":"\nThanks to Sir Wally for the first\none...it's simple really, Wally just asked if I would cache a list of the\ncategories for each configured blog to ai","slug":"2005-05-23-a-couple-of-postxing-ideas"},{"title":"Ever looked back in time?","description":"\nI've been doing just that on my blogs - way back to when this one was hosted on\ndotnetweblogs.com.\nGeez, I was such a dork...okay, maybe I'm still a ","slug":"2005-05-23-ever-looked-back-in-time"},{"title":"To those that care...","description":"\nI.e. Both of you...I've changed the repository structure of PostXING on vaultpub to better facilitate\nbranching.\nThese crazy new ideas I've been havi","slug":"2005-05-24-to-those-that-care"},{"title":"We're back online!","description":"\nIt seems that there was a major power failure yesterday: at least a few city\nblocks. For those that don't know, a city block in Houston is a pretty b","slug":"2005-05-25-Were-back-online"},{"title":"Converting a Base64 String to an image","description":"\n\nDo you ever get an email that has some base64 gobbledegook in it? A lot of\ntimes, based on MIME information directly preceding this junk, it's actua","slug":"2005-05-27-converting-a-base64-string-to-an-image"},{"title":"If I only knew then...","description":"\nNot what I know now, but what I'm learning\nnow. I recently picked up a copy of the src to FlexWikiPad.\nI just wanted to see how things were wired tog","slug":"2005-05-27-if-i-only-knew-then"},{"title":"A new face for PostXING","description":"\n\nI didn't go too too far, I think. It's definitely a step in the right\ndirection, tho:\n\nI don't know why I've opted to start at the top and go down..","slug":"2005-06-10-a-new-face-for-postxing"},{"title":"PostXING development","description":"\n\nI've been working a little on my plugin/provider idea on PostXING. Currently, I have it\nbuilding, but I've had to disable some of the post-build com","slug":"2005-06-10-postxing-development"},{"title":"Greasmonkey goodies; embrace and extend","description":"\n\nThanks to Alex, I\nchecked out a great application of Greasemonkey - the Gmail\nDelete Button.\nOf course, I had to look at the\nscript since it's just ","slug":"2005-06-15-greasmonkey-goodies-embrace-and-extend"},{"title":"PostXING Answers for Yex","description":"\n\nYex sez:\n\n   Nice. So where's the Categories, Post, Post and Publish and Crosspost\n  buttons at? Where's the post editing toolbar? When can we get o","slug":"2005-06-15-postxing-answers-for-yex"},{"title":"RE: This is just a test","description":"\n\nNice! Lookin good, Don! I personally have had firewall issues with FTP (what\na beast!) and have yet to find an opensource SFTP (ftp as a subset of s","slug":"2005-06-15-re-this-is-just-a-test"},{"title":"ReverseDOS in Community Server","description":"\n\nAfter another slew of referrer/comment spam that showed up in my blog this\nmorning, I went ahead and downloaded Mike's ReverseDOS.\nI followed the st","slug":"2005-06-16-reversedos-in-community-server"},{"title":"Blogging API commonalities","description":"\n\nHere is some of the common ground I can see between the metaweblog api and\nCS::Blogs BlogService asmx.\nBlog/Authentication:\n\n  UserName\n  Password\n ","slug":"2005-06-17-blogging-api-commonalities"},{"title":"Maybe I'm Amazed","description":"Tina asked me to learn this Paul McCartney song...so I\ncheated :)\nThat's it. This was purely so I didn't forget the url. Nothing technical to\nsee here","slug":"2005-06-19-maybe-im-amazed"},{"title":"PostXING and interfaces","description":"I feel like I'm going nuts with interfaces in the next version of PostXING. Interfaces are a language\nfeature that is really powerful - you don't real","slug":"2005-06-20-postxing-and-interfaces.ignore"},{"title":"CS::Blogs : beware the permission set","description":"So I got some feedback about PostXING saying that someone who\nhad setup multiple blogs with CS::Blogs was getting the wrong blog\nback while trying to ","slug":"2005-06-23-csblogs--beware-the-permission-set"},{"title":"ReverseDOS: 8 days later","description":"If you are running your own asp.net blogging engine and you support\ncomments/trackbacks/pingbacks, go get\nReverseDOS. Right now. I'll wait.\nBack alrea","slug":"2005-06-23-reversedos-8-days-later"},{"title":"What's this? PostXING can post to dasBlog?","description":"I saw that Jeff\ngot things up and running with PostXING (sorry again about the whole\nBlogInfo[0] thing) when I looked at the url. What's this? dasBlog","slug":"2005-06-25-whats-this-postxing-can-post-to-dasblog"},{"title":"ReverseDOS attracting ire...","description":"I'm seeing a little trend - I delete comment spam as soon as it gets to any\nof my weblogs, so I don't have any hard numbers - posts that I have writte","slug":"2005-06-27-reversedos-attracting-ire"},{"title":"Dangerously close...","date":"2005-07-01 20:41","description":"\n\n...to having something that actually works :) Do you think I'm going a\nlittle nuts with the logo?\n","slug":"2005-07-01-dangerously-close"},{"title":"ReverseDOS Configuration for CS::Blogs revisited","date":"2005-07-02 00:24","description":"I just set up CS::Blogs 1.1 on my server over here and I wanted to keep\nReverseDOS going for it. So I just copied over the settings from my web.config","slug":"2005-07-02-reversedos-configuration-for-csblogs-revisited"},{"title":"Free at last...","date":"2005-07-05 18:33","description":"\n...free at last, thank God Almighty: I am free at last.\n","slug":"2005-07-05-free-at-last"},{"title":"Object cannot be stored in an array of this type.","date":"2005-07-07 05:45","description":"This was the error that was biting me on PostXING v2 for almost a week (I\nusually only get insomnia hours to debug. That can be frustrating.)\n\nThe fir","slug":"2005-07-07-object-cannot-be-stored-in-an-array-of-this-type.ignore"},{"title":"Divelements SandDock 2.0","date":"2005-07-13 16:48","description":"Was just released. In\nthe newsletter, it said that you can use a DocumentContainer (tabs) outside of a\nSandDockManager - simple tabbing with the same ","slug":"2005-07-13-divelements-sanddock-2-0"},{"title":"I feel like a commercial","date":"2005-07-13 23:01","description":"but I did switch to geico\nand I'm going to save a rediculous amount from my current insurance provider. To\nthe tune of nearly $2,000 a year. Plus, the","slug":"2005-07-13-i-feel-like-a-commercial"},{"title":"My favorite Top 11 Country Songs","date":"2005-07-13 19:41","description":"\nGET-R-DONE! My favorite Top 11 Country Songs\n11. If The Phone Don't Ring, You'll Know It's Me.\n10. How Can I Miss You If You Won't Go Away\n9. I Liked","slug":"2005-07-13-my-favorite-top-11-country-songs"},{"title":"Set the passive port range for IIS ftp","date":"2005-07-14 06:06","description":"\nhttp://support.microsoft.com/?id=555022\nI've needed this a couple of times, what better way to find it?\n;)\n","slug":"2005-07-14-set-the-passive-port-range-for-iis-ftp"},{"title":"Saving an embedded resource xml file at runtime in C#","date":"2005-07-18 19:37","description":"\nI couldn't find a cut & dry solution to this (probably b/c it's too\nsimple for anyone to think they would need an example) so here's how I got an\nxml","slug":"2005-07-18-saving-an-embedded-resource-xml-file-at-runtime-in-c.ignore"},{"title":"Ethan and Mama re","date":"2005-07-19 16:51","description":"Welcome to the poor man's vblog...a link with text :) I took this video on my digital camera the other day. It's 2:41. I thought I'd post it up here s","slug":"2005-07-19-ethan-and-mama-re"},{"title":"Clearly a windows user...","date":"2005-07-22 19:30","description":"\n\n[ Currently Playing : Night Bird Flying - Jimi Hendrix -\nExperience Hendrix (3:50) ]\n","slug":"2005-07-22-clearly-a-windows-user"},{"title":"Richard...","date":"2005-07-22 14:39","description":"You're\nWelcome!  :D\n[ Currently Playing : Suite-Pee - System of a Down - System of a\nDown (2:32) ]\n","slug":"2005-07-22-richard"},{"title":"Applesauce tastes gooood.","date":"2005-07-23 23:20","description":"Indeed.\nApplesause tastes\ngoood.\n[ Currently Playing : Audioslave / Number 1 Zero - Audioslave -\nOut Of Exile (05:01) ]\n","slug":"2005-07-23-applesauce-tastes-gooood"},{"title":"Ethan's got some money...","date":"2005-07-23 22:17","description":"\n\nEthan went to go play with his friend Emma today. Emma's older sister gave\nEthan 11¢.\n\nThat's right, the older sister. That boy Ethan...:D\n[ Current","slug":"2005-07-23-ethans-got-some-money"},{"title":"RE - Blog APIs","date":"2005-07-27 23:38","description":"\nDarren's looking\nfor ideas on how to migrate data from one blog engine to the next. This has\nbeen discussed before a lot, I'm sure, but it's not a ba","slug":"2005-07-27-re-blog-apis"},{"title":"Thanks!","date":"2005-07-28 05:58","description":"\nEarlier I said:\n\n  call them \"labels\" or \"tags\" but give me a way to categorize my thoughts.\n  Please.\nThanks, Atom\n1.0 \n[ Currently Playing : A Mess","slug":"2005-07-28-thanks-2"},{"title":"A week already","date":"2005-08-05 22:17","description":"Well, it's been a week now since I handed over my pip-squeak back to his mom.\n\nI gotta say, I miss him a lot. Having him around every day and then all","slug":"2005-08-05-a-week-already"},{"title":"Insanely simple GradientPanel for WinForms","date":"2005-08-10 21:01","description":"\nThis has probably been done a hundred times already, but I couldn't find one\nin the first few pages of google results, so I wrote my own in ~40 lines","slug":"2005-08-10-insanely-simple-gradientpanel-for-winforms.ignore"},{"title":"Dual booting Linux Redhat 9 and Windows XP using a CD","date":"2005-08-26 14:45","description":"\nWe have a couple of legacy applications here, written in C++, that have\nalways run on windows and *nix. In order to support the *nix versions, we alw","slug":"2005-08-26-dual-booting-linux-redhat-9-and-windows-xp-using-a-cd"},{"title":"Darren and BlogML","date":"2005-09-05 22:58","description":"\n\n  A few weeks ago I wanted to release an update to my own blogging engine\n  and, because there was a minor data change I thought that it would be\n  ","slug":"2005-09-05-darren-and-blogml"},{"title":"RE - Google maps .NET control","date":"2005-09-06 19:35","description":"\n\n  Check out this code project article with code for a Google Maps\n  .NET control. very cool and handy stuff. and there are some demos here.\n\n[Via Ti","slug":"2005-09-06-re-google-maps-net-control"},{"title":"Hazaa! 0 unread feeds in my subscriptions","date":"2005-09-07 23:31","description":"\nI took a week off from reading blogs last week (as is evidenced by my\nresponding to week-old posts). I ended up having about 600-700 unread posts in\n","slug":"2005-09-07-hazaa-0-unread-feeds-in-my-subscriptions"},{"title":"RE - RSS Bandit [Nightcrawler Edition] Alpha Progress Report","date":"2005-09-07 22:22","description":"By the way Torsten has started an RSS\nBandit new logo design contest and we'd appreciate your comments. It seems\na lot of our users who use RSS Bandit","slug":"2005-09-07-re-rss-bandit-nightcrawler-edition-alpha-progress-report"},{"title":"RE - www.windowsforms.net is dead","date":"2005-09-07 21:58","description":"\n\n  Anybody else find that MS has so much\n  crap going on that it's hard keep tabs on a single, solid,\n  resources to use to keep up to speed on thing","slug":"2005-09-07-re-www-windowsforms-net-is-dead"},{"title":"It's fixed.","date":"2005-09-08 19:03","description":"\nYesterday I realized that I was having issues with anonymous users posting\ncomments to my CS site. After going\nover the code a little bit, what I did","slug":"2005-09-08-its-fixed"},{"title":"This is getting fixed. Today.","date":"2005-09-08 06:02","description":"\n I noticed that I haven't gotten any comments on my\nblog in a while. Granted, I haven't posted in a while, either, but come on!\nThere's gotta be at l","slug":"2005-09-08-this-is-getting-fixed-today"},{"title":"PostXING v2? Where's the goods?","date":"2005-09-09 05:52","description":"Ah, the joys of writing open source software :/\n\nI had been working hard on v2 of PostXING, but somehow development has\nstagnated on my end quite a bi","slug":"2005-09-09-postxing-v2-wheres-the-goods"},{"title":"Virtual Earth for commercial apps","date":"2005-09-09 22:04","description":"\nHa! Look at\nthat! I totally called\nit.\n[ Currently Playing : All You Need - Sublime - Stand By Your Van\nLive (2:44) ]\n","slug":"2005-09-09-virtual-earth-for-commercial-apps"},{"title":"Eric is a stand-up guy.","date":"2005-09-12 00:17","description":"\n\nEric is my friend Peyman's roommate in Austin. He's a stand-up guy. Trust me\non this.\n","slug":"2005-09-12-eric-is-a-stand-up-guy"},{"title":"My Weekend","date":"2005-09-14 20:20","description":"This is definitely filed under \"As if you cared\". My friend Peyman had a\nlittle gathering at his new house in Austin this past weekend. I've been to\nq","slug":"2005-09-14-my-weekend"},{"title":"Ethan and Cody at the beach","date":"2005-09-18 05:17","description":"I took Ethan and my cousin Cody to the beach today. I got them some du-rags\nand ninja swords, so they could play pirates. They had a sword fight on th","slug":"2005-09-18-ethan-and-cody-at-the-beach"},{"title":"Expected downtime","date":"2005-09-21 15:40","description":"\nJust to let both of you know - I'm expecting some downtime this weekend for\nwww.chrisfrazier.net . See, I live in\nHouston and we've got a little stor","slug":"2005-09-21-expected-downtime"},{"title":"Houstonians are starting to panic.","date":"2005-09-21 21:51","description":"I just got back from the gas station to get some sodas before everything runs\nout, and this is what I saw:\n\n[[photo lost :(\n\nMy little phone wasn't ab","slug":"2005-09-21-houstonians-are-starting-to-panic"},{"title":"Starting to dogfood PostXING v2.","date":"2005-09-30 05:47","description":"I figured that 27 test posts were enough to actually publish one.\n\nThis thing hasn't even reached feature parity with v1, but\nif you both see this pos","slug":"2005-09-30-starting-to-dogfood-postxing-v2"},{"title":"RE - Microsoft Codename \"Spang\"","date":"2005-10-03 17:40","description":"\n\n  Just been shown something Microsoft are working\n  on called \"Spang\" it's UNREAL.\n  When \"Spang\" comes out you'll all be so much\n  happier, wish I ","slug":"2005-10-03-re-microsoft-codename-spang"},{"title":"Creating a Google Maps .NET Control","date":"2005-10-11 20:12","description":"\nChoice Quote:\n\n   Now that I have actually used XSL in a project\n  I've come to this conclusion: XSL is the Devil.\nGo Check it\nOut. It's an interesti","slug":"2005-10-11-creating-a-google-maps-net-control"},{"title":"Visual Studio Editor, how you mock me.","date":"2005-10-12 05:40","description":"\nI've been chasing down this odd Visual\nStudio bug where the Enter, Backspace, and Arrow keys stop working.\nIt happened to me in Redmond at Microsoft ","slug":"2005-10-12-visual-studio-editor-how-you-mock-me"},{"title":"How not to use the PictureBox control.","date":"2005-10-19 21:04","description":"\nI was having this problem in an application that I've been working on where I\nwas drawing data points onto a PictureBox control - kind of like a canv","slug":"2005-10-19-how-not-to-use-the-picturebox-control.ignore"},{"title":"Guess who's going to the World Series?","date":"2005-10-20 04:28","description":"\n\nFan-freakin-tastic. w00t!\n","slug":"2005-10-20-guess-whos-going-to-the-world-series"},{"title":"VistaDB","date":"2005-10-27 15:06","description":" Viral Marketing:\nVistaDB 2.1 database for .NET has been releasedThis 2.1\nupdate includes over 60 improvements, including new support for .NET 2.0 and","slug":"2005-10-27-vistadb"},{"title":"Zeppelin - Babe I'm gonna leave you","date":"2005-10-27 06:12","description":"\nI know I've figured out a fun song when my left hand hurts after\nplaying. That hasn't happened for a loong time.\nI was playing my guitar, trying to s","slug":"2005-10-27-zeppelin-babe-im-gonna-leave-you"},{"title":"Ctrl+K, X","date":"2005-11-04 17:43","description":"Is the insert snippet chord in VS 2005.\n","slug":"2005-11-04-ctrlk-x"},{"title":"ToolStripColorButton - a WinForms 2.0 Control","date":"2005-11-07 18:27","description":"Disclaimer: the code for showing the color menu is totally ripped off of a CodeProject\narticle. I just took the ColorPanel part and parented it with a","slug":"2005-11-07-toolstripcolorbutton-a-winforms-2-0-control"},{"title":"xml-rpc.net and BOM","date":"2005-11-09 08:13","description":"\nI'm using xml-rpc.net as the library\nthat supports xml-rpc for the MetaWeblog api in PostXING.\nI recently ran into a service endpoint that included a","slug":"2005-11-09-xml-rpc-net-and-bom.ignore"},{"title":"Woe unto the COM-referencing VS2005 Winforms Designer","date":"2005-11-10 22:06","description":"One or more errors encountered\nwhile loading the designer. The errors are listed below. Some errors can be\nfixed by rebuilding your project, while oth","slug":"2005-11-10-woe-unto-the-com-referencing-vs2005-winforms-designer"},{"title":"RE - PostXING Review - Yet Another Blog Posting Client","date":"2005-11-15 00:56","description":"\nAh! It's been a while since I've gotten some good PostXING feedback. Guess\nthe current version isn't very keyboard-friendly. I'm probably not going t","slug":"2005-11-15-re-postxing-review-yet-another-blog-posting-clilent"},{"title":"PostXING Sux.","date":"2005-11-16 06:36","description":"\nAnd I know it. I haven't updated the binaries on ProjectDistributor for a long time\nbecause I've been taking my time writing v2. Thing is, it's start","slug":"2005-11-16-postxing-sux"},{"title":"RE - MetaWeblog API beta for MSN Spaces chugs along","date":"2005-11-16 06:02","description":"\n\n  Since announcing that we've started\n  the beta of our implementation of the MetaWeblog API for MSN Spaces, I've received a bunch of\n  positive res","slug":"2005-11-16-re-metaweblog-api-beta-for-msn-spaces-chugs-along"},{"title":"PostXING - Recent Fixes","date":"2005-11-17 18:26","description":"\nNEW: \"PostXING\" in about page now links to postxing.net.\nNEW: FTP Settings page now is labeled as such. This was confusing in the new\nuser wizard.\nFI","slug":"2005-11-17-postxing-recent-fixes"},{"title":"RE - 8 Steps to Better Windows Applications","date":"2005-11-17 07:30","description":"\nIn an attempt to work on steps 7 and 8\nin Grant\nHolliday's Blog, I've started a community server site for PostXING.\nIt's lite on content at the momen","slug":"2005-11-17-re-8-steps-to-better-windows-applications"},{"title":"Jim Ross Dies","date":"2005-11-18 19:56","description":"Our prayers are with you, Jim. I only\nmet Jim in real life one time, and he gave me a ride to my hotel on my first\nvisit to Washington. He lived 5 hou","slug":"2005-11-18-jim-ross-dies"},{"title":"Two years ago...","date":"2005-11-24 06:59","description":"..the idea for PostXING began.\n\nWow. I still hack it every now and then, but I don't devote nearly as\nmuch time as I used to. I'm hoping that the new ","slug":"2005-11-24-two-years-ago"},{"title":"Forcing the DataGridView to do my bidding - a tale of ComboBox hackery","date":"2005-12-07 20:38","description":"\nsigh Winforms team, winforms team, when will you start\nmaking my life easier? As others have said (and I\ncompletely\nagree ) windowsforms.net is prett","slug":"2005-12-07-forcing-the-datagridview-to-do-my-bidding-a-tale-of-combobox-hackery.ignore"},{"title":"PostXING conversation with Peter Provost continues...","date":"2005-12-07 21:07","description":"\nPeter gives me some awesome\nfeedback:\n\n  Hey man. Glad to know you're listening. I really think that PostXING could\n  rock with a little more TLC. Yo","slug":"2005-12-07-postxing-conversation-with-peter-provost-continues"},{"title":"PostXING - Offline Categories","date":"2005-12-07 22:36","description":"Peter, bro, you must be inspirin'\nor something. I hope I didn't miss anything (it was one of those \"it can't be\nthat easy©\" deals), but I'll just let ","slug":"2005-12-07-postxing-offline-categories"},{"title":"System.Net.NetworkInformation","date":"2005-12-10 07:59","description":"This is pretty cool:\nSystem.Net.NetworkInformation.NetworkChange.NetworkAddressChanged +=\nnew System.Net.NetworkInformation.NetworkAddressChangedEvent","slug":"2005-12-10-system-net-networkinformation"},{"title":"NetVibe - listen for network changes and execute a script.","date":"2005-12-12 23:10","description":"A few people asked for the source code/a download for the little widget I whipped up on Friday, so I spent this morning adding a little bit of persist","slug":"2005-12-12-netvibe-listen-for-network-changes-and-execute-a-script"},{"title":"MSN Spaces opens up MetaWeblog API support","date":"2005-12-13 16:34","description":"\nAnd now I can post there with PostXING (v2).\nDare has put up a couple\nof tutorials\non how to setup Metablog support for w.bloggar and BlogJet. Since ","slug":"2005-12-13-msn-spaces-opens-up-metaweblog-api-support"},{"title":"Yahoo! Widgets (Konfabulator) 3.0.2","date":"2005-12-21 08:00","description":"\nI wanted to install the newest version of Konfabulator to one of my\ncomputers, so I went to www.konfabulator.com and tried to install\nthe latest vers","slug":"2005-12-21-yahoo-widgets-konfabulator-3-0-2"},{"title":"PostXING v2 alpha and proxies","date":"2005-12-23 06:53","description":"\nI'd like to apologize if any users of PostXING have to go thru proxies...I've been\nbugchasing this evening and it occurred to me that specifying a pr","slug":"2005-12-23-postxing-v2-alpha-and-proxies"},{"title":"MVP Again","date":"2006-01-11 19:54","description":"\nSo I got selected for the MVP\naward again this year. Many thanks to BenMi, who has been an awesome lead\nthis whole time. You rock, dude.\nI was also a","slug":"2006-01-11-mvp-again"},{"title":"Got my new glasses","date":"2006-01-13 23:28","description":"\nStrictly filed under \"As if you cared\".\n\n[ Currently Playing : Audioslave / Out Of Exile - Audioslave -\nOut Of Exile (4:53) ]\n","slug":"2006-01-13-got-my-new-glasses"},{"title":"MonoDevelop to get a Design-Enabled","date":"2006-01-17 21:11","description":"\nIt's for glade3, but having a\ndesigner will definitely get me looking at Mono again.\n[ Currently Playing : Motel of the white locust - Glassjaw -\nEve","slug":"2006-01-17-monodevelop-to-get-a-design-enabled"},{"title":"RE - PostXING - Better Keyboard Support","date":"2006-01-19 19:45","description":"\nHeh, oops. This is what happens when the tool that you are building is the\nsame tool you are using to make tech notes to yourself.* Really, there sho","slug":"2006-01-19-re-postxing-better-keyboard-support"},{"title":"Gmail Delete Button","date":"2006-01-20 07:18","description":"\nBroseph.\nThis was the first thing that I requested from gmail, and\nthey've taken it up a notch - instead of only deleting messages, it notifies you\ni","slug":"2006-01-20-gmail-delete-button"},{"title":"Thanks, RssBandit.","date":"2006-01-24 08:21","description":"\nRssBandit has been a big inspiration for\nsome of the specific features of PostXING. As\na matter of fact, where possible I've used code from RssBandit","slug":"2006-01-24-thanks-rssbandit"},{"title":"MSBuild - Date-based build number blues","date":"2006-01-26 21:28","description":"\nAccording to this thread, Microsoft may run into visioning problems if they stick with their\nnew build number scheme (major.minor.yMMdd.revision) nex","slug":"2006-01-26-msbuild-date-based-build-number-blues"},{"title":"CIDR Notation Cheat Sheet","date":"2006-01-28 00:13","description":"\n\n  CIDR        Total number    Network\n             Description:Notation:\n   of addresses:\n   Mask:--------------------------------------------------","slug":"2006-01-28-cidr-notation-cheat-sheet"},{"title":"All In Your Head& - DJ Fred Castillo","date":"2006-01-30 21:14","description":"\n\nThis is in the year 2004BB (Before Beard)\n[ Currently Playing : Just A Memory Featuring The C - The\nNotorious B.I.G - (4:30) ]\n","slug":"2006-01-30-all-in-your-head-dj-fred-castillo"},{"title":"BackgroundWorker.isRunning","date":"2006-02-11 18:38","description":"\nThis is a private boolean member of the new BackgroundWorker class in .NET 2.0. If it were public, perhaps there would be less questions\nlike this on","slug":"2006-02-11-backgroundworker-isrunning"},{"title":"Subversion on Windows","date":"2006-02-14 18:08","description":"\nI've been wanting to setup subversion for PostXING for a while so I can have more\ncontrol over who has commit access and various adminy tasks that ar","slug":"2006-02-14-subversion-on-windows"},{"title":"Got My ASP.NET Podcast Shirt","date":"2006-02-15 19:07","description":"I got my ASP.NET Podcast shirt, and\nthere's a lot of Wally to be had it seems...\n\n\n\nYou can't really tell from this pic, but the image of Wally takes ","slug":"2006-02-15-got-my-asp-net-podcast-shirt"},{"title":"FIX - Design View error in VS 2005","date":"2006-02-20 19:20","description":"\nHere's a link to the\nhotfix for the winforms designer error that looks like this:\n\n  One or more errors encountered\n  while loading the designer. The","slug":"2006-02-20-fix-design-view-error-in-vs-2005"},{"title":"PostXING plugin - MetaPinger","date":"2006-03-01 17:47","description":"\nWell, it turns out that PostXING's mystery plugin author is none other than\nTaras Naumtsev, and Taras is on fire! Check out the new MetaPinger plugin","slug":"2006-03-01-postxing-plugin-metapinger"},{"title":"PostXING plugin - TechnoratiTagger","date":"2006-03-01 01:21","description":"\nHoly Schnikeys!\nSomeone has actually built a plugin for PostXING! Ladies and gentlemen, Allow me to\nintroduce the TechnoratiTagger\nplugin for PostXIN","slug":"2006-03-01-postxing-plugin-technoratitagger"},{"title":"Source, are you useful again?","date":"2006-03-07 14:32","description":"\ntesting source\nupdate: nope.\nupdate2: almost: I get a reference to the source,\nbut it's based with the skin's control directory.\nupdate3: BAM! gotta ","slug":"2006-03-07-sourceareyouusefulagain"},{"title":"SubText, BlogML, and PostXING","date":"2006-03-07 14:30","description":"\n\nThis is the end result after setting up SubText and importing my old blog (now moved to here). I had created a blogML\nexporter for cs11 and ran into","slug":"2006-03-07-subtextblogmlandpostxing"},{"title":"PostXING - It's Beta Time!","date":"2006-03-09 14:02","description":"\n\nFor the adventurous among you, we've decided to release beta 1 of PostXING available for download\nat ProjectDistributor!\n\nThere are a few known issu","slug":"2006-03-09-postxingitsbetatime"},{"title":"RE - What is with Blogger.com?","date":"2006-03-10 13:32","description":"I had tried to reply to this post on WinExtra, but it errored out on me. So,\nhere's what the comment said:\nBlogger uses Atom feeds located at http://b","slug":"2006-03-10-rewhatiswithbloggercom"},{"title":"BackgroundWorker.isRunning - take two","date":"2006-03-12 15:07","description":"\nI can't believe nobody called me on this: BackgroundWorker.IsBusy\nProperty\nReflector says it does exactly what I was looking for in a previous\npost.\n","slug":"2006-03-12-backgroundworkerisrunningtaketwo"},{"title":"Quick shoutout to RegexLib.com","date":"2006-03-13 10:42","description":"\nI've got weak regex skillz. I'll admit it.\nI don't use them very much, so when I do need to, it's nice to know that\nregexlib is sitting there, waitin","slug":"2006-03-13-quickshoutouttoregexlib-com"},{"title":"tësting ûnïcode","date":"2006-03-13 11:37","description":"Sorry I keep putting out these tests, but I'm trying to see what different\nregexes will do to a friendly url in subtext. Nothing more to see here.\n[ C","slug":"2006-03-13-testingunicode"},{"title":"RE - SecurePasswordTextBox update","date":"2006-03-14 21:25","description":"\nThis looks interesting. I thought Mr. \"Just\nfinished my last chapter of Beginning AJAX\" would have for sure created this\nas an asp.net control...gues","slug":"2006-03-14-resecurepasswordtextboxupdate"},{"title":"NetVibe - Listen for SSID change","date":"2006-03-20 22:07","description":"\nI've updated the NetVibe source with a mildly useful update: listening for\nchanges in SSID as well as IP Addresses. The source is hosted at http://ch","slug":"2006-03-20-netvibelistenforssidchange"},{"title":"Visual Studio 2005 Designer - Touchy, Thouchy!","date":"2006-03-31 02:55","description":"\nIf you do anything \"out of the ordinary\" in your UserControl or Form derived\nclasses in Visual Studio 2005, let me introduce you to a little snippet ","slug":"2006-03-31-visualstudio2005designertouchythouchy"},{"title":"the yield statement - not so mysterious after all?","date":"2006-04-14 15:13","description":"\n\n  Using Yield in PracticeThe moral of the story is STOP thinking so\n  hard about it, just use \"yield return\" the next piece of data in\n  the list.  ","slug":"2006-04-14-theyieldstatementnotsomysteriousafterall"},{"title":"Getting a temporary filename the easy way","date":"2006-05-04 15:02","description":"\nIf you need to generate temporary / semi-unique filenames, here is a little\nsnippet that uses the framework:\n\nusing System.IO;\n\nstring GetTempFileNam","slug":"2006-05-04-gettingatemporaryfilenametheeasyway"},{"title":"Getting a temporary filename the easy way - feedback","date":"2006-05-04 17:11","description":"\n\n  Jerry Pisk\n  Path.GetTempFileName() guarantees that you will get\n  an available name, it does actually go ahead and create the file so it is\n  gua","slug":"2006-05-04-gettingatemporaryfilenametheeasywayfeedback"},{"title":"I Flipped a Coin","date":"2006-05-04 10:09","description":" Heads: Shave\nthe beard off entirely. Tails: just trim it down a little.\n\nThe coin flips...\n\nand...\n\nHeads it is. \n[ Currently Playing : imagine - Joh","slug":"2006-05-04-iflippedacoin"},{"title":"PostXING - Shameless request for feedback","date":"2006-05-10 15:14","description":"\nhttp://postxing.net/gemini/issue/ViewIssue.aspx?id=32\nI'm about to start cracking on this issue, but I'd love to get a little\nfeedback on it before I","slug":"2006-05-10-postxingshamelessrequestforfeedback"},{"title":"RE - Bad news gets worse","date":"2006-05-12 14:53","description":"\n\n  How do you say goodbye? One hand squeeze at a time.\n[Via Scobleizer\nMicrosoft Geek Blogger]\nSo what do you do when a blogger you read comes up on ","slug":"2006-05-12-rebadnewsgetsworse"},{"title":"Community Server 2.0 BlogML Converter Beta - success!","date":"2006-06-06 13:32","description":"\nI'm a little bit behind on my CS releases, as I just got around to installing\na fresh copy of Community Server 2.0 to test things out for one of my s","slug":"2006-06-06-communityserver2-0blogmlconverterbetasuccess"},{"title":"RE - Using DLINQ with ASP.NET (Part 2 of my LINQ series)","date":"2006-06-07 00:40","description":"Wow.\n","slug":"2006-06-07-reusingdlinqwithasp-netpart2ofmylinqseries"},{"title":"We'll miss you, Mr. Holmquist.","date":"2006-06-13 16:58","description":"\n\nMy\nhigh school principal died on Monday.\n\nThis is surreal. It feels like it was just last week that I was skipping\nclass and getting a pep talk from","slug":"2006-06-13-wellmissyoumrholmquist"},{"title":"Step your game up, Microsoft.","date":"2006-06-29 00:24","description":"\nUnfortunately, the rants about WGA causing a bluescreen are true. It happened\na little while ago on my home PC. Thankfully, F8 booting into safemode ","slug":"2006-06-29-stepyourgameupmicrosoft"},{"title":"Gaffling that ribbon style","date":"2006-07-08 01:36","description":"\n\nClose enough. This\nshould be fun.\n","slug":"2006-07-08-gafflingthatribbonstyle"},{"title":"What's this? My Application won't Exit?","date":"2006-07-14 11:40","description":"There are a few things that have to happen for this \"regression\" to show up. First, you have to be working in .net 2.0 WinForms. Second, you must be u","slug":"2006-07-14-whatsthismyapplicationwontexit"},{"title":"Whip it Real Hard","date":"2006-07-20 12:52","description":"\n\nLast night I got\nan impromtu text message saying that Ghostface\nKillah was playing at Warehouse live downtown. As a Wu-Tang fan, I\ndecided to go out","slug":"2006-07-20-whipitrealhard"},{"title":"RE Finding calling method using reflection","date":"2006-08-11 17:00","description":"\nExactly\nwhat I was looking for...I don't know a lot about reflection, so I wonder if\nthere is a more elegant way to get this info.\n","slug":"2006-08-11-refindingcallingmethodusingreflection"},{"title":"Windows Live Writer","date":"2006-08-17 02:40","description":"\n\n It looks pretty neat. I really dig the\n\"type inside the preview\" Web Layout. That's just sweet. The plugin support\nlooks promising...I've already s","slug":"2006-08-17-windowslivewriter"},{"title":"RE - What about PostXING?","date":"2006-08-22 18:59","description":"\n\n  I love the PostXING tool and the\n  ability to integrate the playing music. Feature wise they are all about the\n  same though. So it will interesti","slug":"2006-08-22-rewhataboutpostxing"},{"title":"..||..","date":"2006-09-11 18:06","description":"\nhttp://www.zefrank.com/theshow/archives/2006/09/091106.html\n","slug":"2006-09-11-669"},{"title":"SubSonic Scaffold control - a GridView with Class","date":"2007-03-08 15:40","description":"\nSo I've been able to dig my teeth into some asp.net hacking recently, and\nI've been wrestling with learning to use SubSonic in the process.\n\nIn deali","slug":"2007-03-08-subsonicscaffoldcontrolagridviewwithclass"},{"title":"ASP.NET - UrlRewriting with PathInfo and base urls","date":"2007-03-15 13:45","description":"\nI read this\nexcellent post from ScottGu and decided to use it with a page that\nimplemented a masterpage. I didn't have to use postbacks in my scenari","slug":"2007-03-15-asp-neturlrewritingwithpathinfoandbaseurls"},{"title":"skmMenu code change to work with xhtml doctypes","date":"2007-03-22 12:10","description":"\nThis is just a re-statement of a forum\nthread that discusses the fix, but since gotdotnet is not going to be\naround very much longer I thought I'd po","slug":"2007-03-22-skmmenucodechangetoworkwithxhtmldoctypes"},{"title":"Windows Updates Make Me Nervous","date":"2007-03-22 17:45","description":" hehe...\n\n  Rather surprised by the new 'updates are ready' message from Microsoft.\n  Hmmm.\n\n  Perhaps they know just how much frustration we had on t","slug":"2007-03-22-windowsupdatesmakemenervous"},{"title":"Exposing Hidden Events","date":"2007-04-25 17:44","description":"\nI recently ran into a neat little nugget of functionality in C# with events.\nNormally in C# when we define events we stop at something like this:\n\npu","slug":"2007-04-25-exposinghiddenevents"},{"title":"Sql Server Management Studio Express - you suck.","date":"2007-05-25 14:03","description":"\nI would like to know who thought it was a good idea to remove \"import\ndata...\" and \"export data...\" from this particular flavor of the worst front en","slug":"2007-05-25-sqlservermanagementstudioexpressyousuck"},{"title":"So quiet...","date":"2007-06-07 19:17","description":"\n...and so dark in here.\n","slug":"2007-06-07-soquiet"},{"title":"Christopher is ...","date":"2007-06-29 19:34","description":"\nposted up watchin Shrek 2 with Ethan.:)\n \n","slug":"2007-06-29-christopher-is"},{"title":"Paul Stovell has lost his marbles.","date":"2007-07-25 04:35","description":"[note: this started as a comment but started getting a little long-winded. what follows is a little gentle ribbing of Paul for a recent post he wrote ","slug":"2007-07-25-paulstovellhaslosthismarbles"},{"title":"Setting up a new External to Internal IP mapping on OpenBSD","date":"2007-07-27 15:16","description":"This is correct for version 3.9 of OpenBSD, but the rules are simple enough that the idea will upgrade if necessary later. In order to complete this, ","slug":"2007-07-27-settingupanewexternaltointernalipmappingonopenbsd"},{"title":"Blog Moving","date":"2007-11-14 12:35","description":"\nI noticed that a handful of people are still subscribed to this little ol'\nweblog. Well, I've decided to start fresh at a new url http://bluefenix.ne","slug":"2007-11-14-blog_moving"},{"title":"HappyMappy","date":"2007-11-14 16:26","description":"As a thanx you to Sir Wally for  kicking me in the butt to start blogging again, I'm linking to a site he told me  about called HappyMappy.com that he","slug":"2007-11-14-happymappy"},{"title":"O Hai.","date":"2007-11-14 14:03","description":"\nand welcome to my new blog. :)\n","slug":"2007-11-14-o_hai"},{"title":"Darren Neimke on building ajax applications in asp.net","date":"2007-11-25 22:00","description":"Darren Neimke talks about building ajax applications, both with and without a button to intercept...Darren has this way of explaining things in a way ","slug":"2007-11-25-darren_neimke_on_building_ajax_applications_in_asp-net"},{"title":"Guitar Hero -  Pros","date":"2007-11-28 16:51","description":"pros indeed. Unfortunately, there are no Jimi Hendrix tracks on any of the Guitar Hero/Rock Band games. I really hope that changes some day. There is ","slug":"2007-11-28-guitar_hero_pros"},{"title":"DataGridView ColorPicker using a DataGridViewButtonColumn","date":"2007-12-13 20:41","description":"It's not often that I get the opportunity to blog about something neat that I learned to do in winforms so you know I gotta, even tho it's not totally","slug":"2007-12-13-datagridview_colorpicker_using_a_datagridviewbuttoncolumn"},{"title":"Cheap Thrillz - TortoiseSVN overlay icons in Windows Vista","date":"2008-01-02 01:55","description":"\n\nStep1: install tortoisesvn.\n\nStep2: open file dialog in vs.net (2008 at least)\n\nStep3: XD\n\nupdate: looks like the tortoisesvn team brought back thos","slug":"2008-01-02-cheap_thrillz_tortoisesvn_overlay_icons_in_windows_vista"},{"title":"Oh, she amazed me!","date":"2008-01-24 14:34","description":"Effing brilliant.\n","slug":"2008-01-24-oh_she_amazed_me"},{"title":"Bring it on!","date":"2008-02-05 15:30","description":"31\n \n","slug":"2008-02-05-bring_it_on"},{"title":"Error - Could not open the requested SVN filesystem","date":"2008-02-20 16:46","description":"When trying to connect to a new subversion repository over apache 2.0 using subversion 1.4.5. Error number:165005\nLooked at the error log for apache, ","slug":"2008-02-20-error_could_not_open_the_requested_svn_filesystem"},{"title":"Professional Ribbon control for Windows Forms","date":"2008-05-14 16:32","description":"Open source (MSPL) Ribbon that actually has some potential, despite the currently incomplete coverage of ribbon features. It's a winforms control, and","slug":"2008-05-14-professional-ribbon-control-for-windows-forms"},{"title":"Welcome Back, Dare","date":"2008-05-21 13:15","description":"...and thank goodness that hiatus is over. XD\n","slug":"2008-05-21-welcome-back-dare"},{"title":"jQuery - There is no spoon","date":"2008-06-23 13:06","description":"I've been working with javascript almost since its inception. It was the first language that I ever really hacked in. I remember having to code around","slug":"2008-06-23-jquery-there-is-no-spoon"},{"title":"Good Luck, Yex","date":"2008-07-03 22:39","description":"      Godspeed buddy. XD\n","slug":"2008-07-03-good-luck-yex"},{"title":"Houston ALT.NET Geek Dinner - Thursday Oct 2nd","date":"2008-09-30 08:29","description":"\nI'll be there.\n","slug":"2008-09-30-houston-alt-net-geek-dinner-thursday-oct-2nd"},{"title":"SubSonic 3.0 preview 2","date":"2008-11-13 15:10","description":"\nme\nlikey.\n","slug":"2008-11-13-subsonic-3-0-preview-2"},{"title":"Andre 3 stacks in NY","date":"2008-11-22 17:31","description":"Andre 3 stacks in NY\n\nOriginally uploaded by blue_fenix\n\nI ran into Andre 3000 last time I went to NYC. Really down to earth dude.\nChristopher | bluef","slug":"2008-11-22-andre-3-stacks-in-ny"},{"title":"RAWR!","date":"2008-11-22 20:52","description":"\n RAWR!\nOriginally uploaded by blue_fenix   RAWR! I eats teh turkee, you no has tanksgiving nao.\n\nHalp!\n\n--\n-Christopher | bluefenix.net\n","slug":"2008-11-22-rawr"},{"title":"Ethan's got holiday spirit!","date":"2008-12-20 20:18","description":"\n\n\n\nEthan's got holiday spirit!, originally uploaded by blue_fenix.\n\n\nHehe jingle this! Ethan just turned 7, and he's missing a bottom tooth!\n\n--\n-Chr","slug":"2008-12-20-ethans-got-holiday-spirit"},{"title":"The Don Juan Especiál","date":"2009-01-25 14:21","description":"\n\n\n\nThe Don Juan Especiál, originally uploaded by blue_fenix.\n\n\nBreakfast taco Nirvana from Juan in a million, Austin, TX\n\n--\n-Christopher | bluefenix","slug":"2009-01-25-the-don-juan-especial"},{"title":"Ethan's a little snagglepuss!","date":"2009-01-30 16:17","description":"\n\n\n\nEthan's a little snagglepuss!, originally uploaded by blue_fenix.\n\n\n--\n-Christopher | bluefenix.net\n\n","slug":"2009-01-30-ethans-a-little-snagglepuss"},{"title":"February ALT.NET Geek Dinner","date":"2009-02-03 13:39","description":"I'll be there.\n","slug":"2009-02-03-february-alt-net-geek-dinner"},{"title":"Ethan & Ricky pup!","date":"2009-02-20 17:28","description":"\n\n\n\nEthan &amp; Ricky pup!, originally uploaded by blue_fenix.\n\n\n--\n-Christopher | bluefenix.net\n\n","slug":"2009-02-20-ethan-ricky-pup"},{"title":"at the Rockets game vs Cleveland","date":"2009-02-26 19:25","description":"\n\n\n\n@ the Rockets game vs Cleveland, originally uploaded by blue_fenix.\n\n\n--\n-Christopher | bluefenix.net\n\n","slug":"2009-02-26-the-rockets-game-vs-cleveland"},{"title":"New ink - Hook ups girl","date":"2009-03-03 19:19","description":"\n\n\n\nNew ink: Hook ups girl, originally uploaded by blue_fenix.\n\n\nShe's a hottie, ain't she? XD\n\n--\n-Christopher | bluefenix.net\n\n","slug":"2009-03-03-new-ink-hook-ups-girl"},{"title":"Kevin Devine @ Mohawk's","date":"2009-03-18 12:22","description":"\n\n\n\nKevin Devine @ Mohawk's #sxsw, originally uploaded by blue_fenix.\n\n\nFrom Brooklyn.\n\n--\n-Christopher | bluefenix.net\n\n","slug":"2009-03-18-kevin-devine-mohawks-sxsw"},{"title":"New ink - hacker emblem","date":"2009-04-09 21:09","description":"\n\n\n\nNew ink: hacker emblem, originally uploaded by blue_fenix.\n\n\n--\n-Christopher | bluefenix.net\n\n","slug":"2009-04-09-new-ink-hacker-emblem"},{"title":"New ink - killer octopus!","date":"2009-04-17 00:27","description":"\n\n\n\nNew ink: killer octopus!, originally uploaded by blue_fenix.\n\n\nInk by Rob of Nice Guyz.\n\n--\n-Christopher | bluefenix.net\n\n","slug":"2009-04-17-new-ink-killer-octopus"},{"title":"New ink - Japanese devil mask!","date":"2009-04-23 02:29","description":"\n\n\n\nNew ink: Japanese devil mask!, originally uploaded by blue_fenix.\n\n\nInk by Rob of Nice Guyz.\nArigato gozai mashta! XD\n\n--\n-Christopher | bluefenix","slug":"2009-04-23-new-ink-japanese-devil-mask"},{"title":"Homemade Don Juan Especial!","date":"2009-07-27 16:18","description":"\nHomemade Don Juan Especial!, originally uploaded by blue_fenix.\n I haven't been to Austin, tx in a while and was craving my favorite\nbrakfast taco fr","slug":"2009-07-27-homemade-don-juan-especial"},{"title":"Bankai! New ink - Kurosaki Ichigo hollow mask","date":"2009-08-29 20:14","description":"\n\n\n\nBankai! New ink - Kurosaki Ichigo hollow mask, originally uploaded by blue_fenix.\n\n\n--\n-Christopher | bluefenix.net\n\n","slug":"2009-08-29-bankai-new-ink-kurosaki-ichigo-hollow-mask"},{"title":"Ethan and Lord Nobleton!","date":"2009-10-03 21:12","description":"\n\n\n\nEthan and Lord Nobleton!, originally uploaded by blue_fenix.\n\n\n\n\n","slug":"2009-10-03-ethan-and-lord-nobleton"},{"title":"Deran Schilling, Learner","date":"2009-12-29 17:41","description":"\nCheck this: \"AutoMapper\nASP.NET MVC\" on Deran Schilling,\nLearner.\nI've been catching up on Deran's posts about his wife's portfolio site. I'm\nquite e","slug":"2009-12-29-deran-schilling-learner"},{"title":"What to do if your Windows 2008 install won't activate complaining about no KMS server","date":"2009-12-29 11:09","description":"\nBasically this is what happened:The MSDN subscriptions version of\nWindows Server 2008 installs by default using KMS (Key Management\nService).The key ","slug":"2009-12-29-what-to-do-if-your-windows-2008-install-wont-activate-complaining-about-no-kms-server"},{"title":"Scanning for Test implementation classes using StructureMap with xunit","date":"2010-02-18 07:59","description":"\nI have an xunit test project that is using hand-rolled stubs as concrete implementations of interfaces.\nStructureMap is\nthe DI container I'm using. I","slug":"2010-02-18-scanning-for-test-implementation-classes-using-structuremap-with-xunit"},{"title":"How to resolve a binary file conflict with Git","date":"2010-03-05 21:09","description":"http://www.lostechies.com/blogs/joshuaflanagan/archive/2010/01/28/how-to-resolve-a-binary-file-conflict-with-git.aspx\nThank you for that!\nAlthough the","slug":"2010-03-05-how-to-resolve-a-binary-file-conflict-with-git"},{"title":"Unable to find the requested .Net Framework Data Provider.  It may not be installed.","date":"2010-04-06 11:20","description":"\n\n\nthis happened to me using subsonic on an x64 machine. adding the x64 binary\nto /bin and adding the above to my web.config got me sorted.\n","slug":"2010-04-06-unable-to-find-the-requested-net-framework-data-provider-it-may-not-be-installed"},{"title":"Sunburst Font & Color scheme for Visual Studio 2010","date":"2010-04-20 08:16","description":"\nHere is a clone of the TextMate theme \"Sunburst\" for Visual Studio 2010: http://bluefenix.net/etc/blue_fenix_sunburst_lite.zip\nI just guessed on the ","slug":"2010-04-20-sunburst-font-color-scheme-for-visual-studio-2010"},{"title":"ASP.NET MVC - Faking ControllerContext to test HttpContext.Current.User and IPrincipal","date":"2010-06-22 12:57","description":"\nThis was pretty straightforward but I didn't find it written up anywhere on\nthe web so here goes. What follows is how I addressed testing IPrincipal ","slug":"2010-06-22-asp-net-mvc-faking-controllercontext-to-test-httpcontext-current-user-and-iprincipal"},{"title":"GIT flow on windows 7 with msysgit","date":"2010-09-30 15:07","description":"this is outlined on github by psampaio:     I managed to get git flow working with msysGit, but needed some hacks on my setup. First, I copied all the","slug":"2010-09-30-git-flow-on-windows-7-with-msysgit"},{"title":"Underbelly project in my living room","date":"2012-03-09 16:44","description":"It started when I saw a piece from the underbelly project NYC by :01.\n\nIt inspired me. I think it's beautiful. So I made a transparency of it to cut m","slug":"2012-03-09-underbelly-project-in-my-living-room"},{"title":"Same","date":"2012-03-31 03:51","description":"Same.\n","slug":"2012-03-31-same"},{"title":"Using git flow with github for windows","date":"2012-07-02 19:16","description":"I like github for windows. Seriously, they did a great job with it - kudos, Phil. I like that it has an updateable bash shell ala msysgit. I also like","slug":"2012-07-02-using-git-flow-with-github-for-windows"},{"title":"-git-flow-and-github-for-windows","excerpt":"Here's the most recent way I've kept git-flow on my windows 8 machines and up in my life.","description":"\nwhat, no getopt?\n\nEvery time github for windows updates, I lose git-flow. The portable git that is extracted with the install doesn't include getopt.","slug":"2013-07-07-git-flow-and-github-for-windows"},{"title":"github flow","excerpt":"instead of fighting with hidden directories to keep git flow functional with github for windows, I've decided to just simplify.","description":"\nWhat is github flow?\nI will let them explain that. I guess the basic idea is to simplify the way git flow encourages you to organize branches.\n\nI'm g","slug":"2013-07-16-github-flow"},{"title":"Wheelers for a cause","description":"Went to Texas Off Road Ranch in Huntsville with tx4wd to have a little fun run. The for a cause part was for 5th ward dogs so we brought dog food for ","slug":"2013-07-28-WFAC"},{"title":"Hi.","date":"2014-05-12 20:41","description":"Hello. How ya durrin?\n","slug":"2014-05-12-hi"},{"title":"Opening Visual Studio with Rake","date":"2014-08-06 21:13","description":"There are probably several ways to do this, here’s how I did.\n\nrakefile.rb:\n\nDIR = File.dirname(FILE)\ndesc \"Starts Visual Studio with the project solu","slug":"2014-08-06-opening-visual-studio-with-rake"},{"title":"Did I lose that post?","date":"2014-08-25 12:46","description":"Looks like I did. Oh well. You'll never see the glory of that shitty post. Fuck it.\n","slug":"2014-08-25-did-i-lose-that-post"},{"title":"I forgot.","date":"2014-08-25 13:02","description":"About 6 years ago I joined twitter. I found an outlet for random ideas with a small constraint: 140 characters or less. And I abused the fuck out of i","slug":"2014-08-25-i-forgot"},{"title":"Debian Linux","description":"how I got up and running with a dual-boot configuration in a day.","slug":"2015-10-07-debian-linux"},{"title":"switched engines again","description":"extended babbling about changing blog enginges for maybe the dozenth time.","slug":"2015-10-07-switched-engines-again"},{"title":"Running 1Password on Debian Linux","description":"How I got 1Password for Windows running on Debian Linux","slug":"2016-04-05-running-1password-on-debian-linux"},{"title":"recode","description":"the only constant...","slug":"2016-04-20-recode"},{"title":"#ripprince","description":"Electric word life.\n\nit means forever and that's a mighty long time.\n","slug":"2016-04-24-ripprince"},{"title":"San Juan","description":"\ngoing to Puerto Rico rn XD\n","slug":"2016-04-30-sanjuan"},{"title":"angle between three points","description":"\nThis was a task I had to complete to attempt to find a right angle from 3 cartesian coordinates, +/- 5 degrees.\n\nOf course the first place I looked w","slug":"2016-05-17-angle-between-three-points"},{"title":"Por seguro…","description":"\nfuck yeah bro.","slug":"2016-05-18-por-seguro"},{"title":"Unable to activate albacore-2.5.13","description":"\nUnable to activate albacore-2.5.13, because rake-11.1.2 conflicts with rake (~> 10)\n\nI had recently updated Ruby to version 2.3, which updated rake t","slug":"2016-06-07-unable-to-activate-albacore-2.5.13"},{"title":"Making Windows the default operating system in grub 2","description":"\ntl;dr: change GRUB_DEFAULT=0 to the zero-based index of the Windows entry in the grub config file.\n\nWindows updates seem to be happening at least onc","slug":"2016-12-15-making-windows-the-default-operating-system-in-grub-2"},{"title":"Liquid Exception: no implicit conversion of Array into String in _layouts","description":"\"Liquid Exception: no implicit conversion of Array into String in /\\_layouts/post.html\"\n\nI was attempting to finally add an archive page to my jekyll ","slug":"2017-08-20-liquid-exception-no-implicit-conversion-of-array-into-string-in-_layouts"},{"title":"github for windows and babun","description":"If you are on windows 10, you can simply use a linux subsystem. That ain’t what we’re talmbout here.\n\nbabun is a cygwin based shell with a bunch of de","slug":"2018-05-22-github-for-windows-and-babun"},{"title":"bee vs hive","description":"\n\"That which injures the hive injures the bee.\"\n- Marcus Aurelius","slug":"2019-02-12-bee-vs-hive"},{"title":"ERROR: Failed to build gem native extension","description":"\nI ran into this problem on a fresh install of Ubuntu 18.04.3 LTS. I had not installed development tools yet, so I found this which prompted me to add","slug":"2019-08-22-error-failed-to-build-gem-native-extension"},{"title":"2019-09-19 15:45:33","description":"\nI changed the post and draft tasks in the Rakefile for this site to use the current date as the title if the user doesn't add one. Makes more sense..","slug":"2019-09-19-2019-09-19-154533"},{"title":"bluefenix.net","description":" a new hope\n\nI'm still working on copy, but I've relaunched bluefenix.net. It will be linked to this blog right here...I'm putting the finishing touch","slug":"2020-04-05-a-new-hope"},{"title":"RE: bluefenix.net","description":"\nI've upgraded bluefenix.net and changed it up a little bit. The copy that was there previously turned out to be custom lorem ipsum content. I still h","slug":"2021-02-04-2021-02-04-182429"},{"title":"Starting a new journey","description":"\nI started a new job yesterday.\n\nIt's great to start a new journey and I'm so excited for what this new job has in store for me. They trusted me from ","slug":"2022-09-28-starting-a-new-journey"},{"title":"PostXING.MetaWeblogProxy - a C# proxy for calling the MetaWeblog API via xml-rpc","description":"I am happy to announce the release of PostXING.MetaWeblogProxy, a C# proxy for calling the MetaWeblog API via xml-rpc. The project is hosted on GitHub","slug":"2022-10-01-released-postxing.metaweblogproxy"},{"title":"An error occurred while installing racc","description":"\nAn error occurred while installing racc (1.6.2), and Bundler cannot continue.\n\nI'm trying to get jekyll to build on my MacBook, with macOS Monterey v","slug":"2023-01-18-an-error-occurred-while-installing-racc"},{"title":"GitHub CoPilot","description":"\nI was using GitHub CoPilot and ran into a perfect example of keystrokes saved when writing boilerplate code.\n\nFirst, I created a list here with jekyl","slug":"2023-01-19-github-copilot"},{"title":"SOLVED: Ruby on Monterey","description":"I was able to get ruby installed on my MacBook thanks to this guide. I already had GitHub setup, but I didn't have rbenv installed.\n\nFollowing this gu","slug":"2023-02-08-solved-ruby-on-monterey"},{"title":"My Journey to Setting up a Local Development Mastodon Instance","description":"\nMastodon Development Instance\n\nI've been looking for a way to update my skills in web development recently while searching for a new job. I've been w","slug":"2023-03-08-my-journey-to-setting-up-a-local-development-mastodon-instance"},{"title":"Mangekyo","description":"\nmangekyo\n","slug":"2024-02-08-mangekyo"},{"title":"The Declaration of Snugland","description":"\n🏴‍☠️ The Declaration of Snugland 🏴‍☠️\n\nBe it known to all ye hearty souls, scallywags, and pillow-fort enthusiasts!\nWhereas the sun doth rise and s","slug":"2024-02-18-the-declaration-of-snugland"},{"title":"Discourse Fresh Install on Mac OS","date":"2024-03-02T00:00:00.000Z","description":"\nIntroduction\nSo, most of the install instructions are correct, but there are a few extra steps I had to figure out. I will go through the steps to in","slug":"2024-03-02-discourse-fresh-install"},null]